{
  "Arts and Media/Arts": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit ARHU 101 The Art of Interpretation: Written Texts 4 ARHU 102 The Art of Interpretation: Images and Sound 4 Interdisciplinary Courses Course Code Course Name Course Credit MEDIART 101 [16] Introduction to Arts and Media 4 MEDIART 209 Introduction to Visual Culture 4 MEDIART 210 [17] Arts and Media Practicum 4 MEDIART 490 Senior Seminar: Advanced Topics 4 Choose 4 Creative Practice Elective courses from within the same concentration, two at the 100-200 level and two at the 300-400 level. [16] This course was named MEDIART 101 Introduction to Media Studies and the Arts prior to fall term 2023. [17] This course was named MEDIART 210 Media and Arts Practicum prior to fall term 2023. Disciplinary Courses Course Code Course Name Course Credit HIST 207/ARTS 207 [18] History of Art and Science 4 HIST 210/ARTS 211 Global Art History 4 And choose two 4-credit courses from the list below HIST 106/ARTS 106 European Art History 4 ARTS 201 [19] Introduction to Film Studies 4 ARTS 202 [20] Contemporary Documentary Film 4 GCHINA 203/ARTS 203 Visual China: Modern Chinese History and Culture through Film 4 HIST 217/ARTS 217 [21] Arts of China 4 HIST 218/ARTS 219 [22] Women in East Asian Art 4 LIT 208/ARTS 208 From Cool Japan to the Korean Wave: Popular Culture from East Asia 4 MEDIART 211 Media, Arts, and Critical Theory 4 MEDIART 224 Animation: From Anima to Anime 4 PHYS 105/ARTS 105 [23] The Science of Traditional Asian Music 4 [18] This course was named HIST 207 History of Media Art prior to fall term 2023. [19] [endif] This course was named and numbered MEDIART 105 Introduction to Film Studies prior to fall term 2023. [if !supportFootnotes] [20] This course was named and numbered MEDIART 302 Contemporary Documentary Film prior to fall term 2023. [21] [endif] This course was named and numbered HIST217/MEDIART 217 Ancient and Imperial Chinese Art prior to fall term 2023. [22] [endif] This course was named HIST 218 Premodern East Asian Female Art prior to fall term 2023. [23] [endif] This course was named PHYS 105 the Science of Asian sound prior to fall 2023 term",
      "metadata": {
        "file_name": "arts_&_media_major_with_tracks_in_arts_and_media_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Arts and Media/Arts"
      }
    },
    {
      "text": ". Creative Practice Thematic Concentrations In addition to serving as Creative Practice Concentrations, the courses listed in the tables below are recommended electives for the major. The course list reflects the most recent intellectual organization of major electives. Depending on the academic year in which you matriculated, some of the courses below may be requirements for your major. To verify required courses, always consult the requirements for the relevant class year in the bulletin of the year in which you matriculated unless you have been approved to complete the major requirements of a subsequent year. (See Ability to Meet Major Requirements Published in Years Subsequent to Year of Matriculation.) Film & Documentary Course Code Course Name Course Credit Choose two of the following 100-200 level courses MEDIART 103 Introduction to Moving Image Practice 4 MEDIART 110 [24] Audio Documentary and the Podcast 4 MEDIART 207 [25] Elements of Story: Introduction to Narrative Structure 4 MEDIART 212 Editing for the Video Essay 4 MEDIART 220 Visual Anthropology 4 MEDIART 223 Shot by Shot: Concept and Frame Composition 4 Choose two of the following 300-400 level courses MEDIART 301 Experimental Filmmaking 4 MEDIART 305 [26] Advanced Documentary Practice 4 MEDIART 310 Screenwriting 4 MEDIART 311 Cinematography 4 MEDIART 323 [27] Sound Design and Music for Film 4 MEDIART 498 Special Topics in Film & Documentary 4 [24] This course was named MEDIART 110 Audio Documentary and Storytelling prior to fall term 2023. [25] [endif] This course was named MEDIART 207 Creative Writing and the Elements of Story prior to fall term 2023",
      "metadata": {
        "file_name": "arts_&_media_major_with_tracks_in_arts_and_media_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Arts and Media/Arts"
      }
    },
    {
      "text": ". [26] This course was named MEDIART 305 Producing Docu-fiction prior to fall term 2023. [27] This course was named MEDIART 218 Music and Cinema prior to fall term 2023. Studio & Performance Course Code Course Name Course Credit Choose two of the following 100-200 level courses LIT 216 Introduction to Creative Writing and Translation 4 MEDIART 104 Introduction to Photography 4 MEDIART 117 Studio Drawing and Animation 4 MEDIART 118 Introduction to Dance and Choreography 4 MEDIART 120 [28] Introduction to Theatre and Performance Studies 4 MEDIART 198 Special Topics in Creative Practice 4 MEDIART 221 Introduction to Composition 4 MEDIART 222 Electronic Sound: Sampling and Synthesis 4 MEDIART 225 [29] Fundamentals of Tonal Music Theory 4 Choose two of the following 300-400 level courses LIT 311 Poetry in Conversation 4 MEDIART 301 Experimental Filmmaking 4 MEDIART 322 Installation Art 4 MEDIART 323 [30] Sound Design and Music for Film 4 MEDIART 324 [31] The Photographic Essay 4 HUM 405/MEDIART 405 The Curatorial: Theory and Practice 4 [28] This course was numbered and named MEDIART 216 Performance, Embodiment, and Cultural Memory prior to fall term 2023. [29] This course was numbered and named MEDIART 115 Introduction to Music Theory prior to fall term 2023. [30] This course was named MEDIART 218 Music and Cinema prior to fall term 2023. [31] This course was numbered MEDIART 204 The Photographic Essay prior to fall term 2023. Digital Culture & Communication Course Code Course Name Course Credit Choose two of the following 100-200 level courses INFOSCI 105 Experimental Interface Design 4 INFOSCI 202 3D Modelling and Animation 4 MEDIART 110 [32] Audio Documentary and the Podcast 4 MEDIART 202 [33] Creativity and Entrepreneurship 4 MEDIART 205 Digital Imaging and Graphic Design 4 MEDIART 207 [34] Elements of Story: Introduction to Narrative Structure 4 MEDIART 212 Editing for the Video Essay 4 MEDIART 213 [35] Web-Based Multimedia Design 4 Choose two of the following 300-400 level courses LIT 307 Digital Storytelling 4 INFOSCI 305 Virtual Museums and Digital Cultural Heritage 4 INFOSCI 309 Speculative and Critical Design 4 MEDIART 312 Graphic Design in Motion 4 MEDIART 321 Practices in Digital Humanities 4 MEDIART 401 Campaigns, Marketing, and Persuasion 4 [32] This course was named MEDIART 110 Audio Documentary and Storytelling prior to fall term 2023. [33] The course was named MEDIART 202 Ideas, Imagination, and Creativity prior to fall term 2023. [34] This course was named MEDIART 207 Creative Writing and the Elements of Story prior to fall term 2023",
      "metadata": {
        "file_name": "arts_&_media_major_with_tracks_in_arts_and_media_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Arts and Media/Arts"
      }
    },
    {
      "text": ". [35] This course was named MEDIART 213 Foundations of Web-Based Multimedia Communications prior to fall term 2023.",
      "metadata": {
        "file_name": "arts_&_media_major_with_tracks_in_arts_and_media_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Arts and Media/Arts"
      }
    }
  ],
  "Arts and Media/Media": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit ARHU 101 The Art of Interpretation: Written Texts 4 ARHU 102 The Art of Interpretation: Written Texts 4 Interdisciplinary Courses Course Code Course Name Course Credit MEDIART 101 [36] Introduction to Arts and Media 4 MEDIART 209 Introduction to Visual Culture 4 MEDIART 210 [37] Arts and Media Practicum 4 MEDIART 490 Senior Seminar: Advanced Topics 4 Choose 4 Creative Practice Elective courses from within the same concentration, two at the 100-200 level and two at the 300-400 level. [36] This course was named MEDIART 101 Introduction to Media Studies and the Arts prior to fall term 2023. [37] The course was named MEDIART 210 Media and Arts Practicum Prior to fall term 2023. Disciplinary Courses Course Code Course Name Course Credit CULANTH 201/MEDIA 201 New Media and Society 4 MEDIART 211 Media, Arts, and Critical Theory 4 And choose two 4-credit courses from the list below CULANTH 202/MEDIA 202/GCULS 201 Culture and Industry 4 CULANTH 207/MEDIA 207 Cultures of New Media 4 LIT 204/MEDIA 204 Online Novels and the Chinese Public Sphere 4 INFOSCI 104/MEDIA 104 Digital Design 4 INFOSCI 201 Interaction and Physical Computing 4 MEDIA 203 [38] Global Media and Communication 4 MEDIART 208 [39] Chinese Mass Media 4 MEDIART 224 Animation: From Anima to Anime 4 [38] This course was named and numbered MEDIART 307 International Communication prior to fall 2023 term. [39] This course was named MEDIART 208 Comparative Media Systems and Chinese Mass Media prior to fall term 2023. Creative Practice Thematic Concentrations In addition to serving as Creative Practice Concentrations, the courses listed in the tables below are recommended electives for the major. The course list reflects the most recent intellectual organization of major electives. Depending on the academic year in which you matriculated, some of the courses below may be requirements for your major",
      "metadata": {
        "file_name": "arts_&_media_major_with_tracks_in_arts_and_media_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Arts and Media/Media"
      }
    },
    {
      "text": ". To verify required courses, always consult the requirements for the relevant class year in the bulletin of the year in which you matriculated unless you have been approved to complete the major requirements of a subsequent year. (See Ability to Meet Major Requirements Published in Years Subsequent to Year of Matriculation.) Film & Documentary Course Code Course Name Course Credit Choose two of the following 100-200 level courses MEDIART 103 Introduction to Moving Image Practice 4 MEDIART 110 [40] Audio Documentary and the Podcast 4 MEDIART 207 [41] Elements of Story: Introduction to Narrative Structure 4 MEDIART 212 Editing for the Video Essay 4 MEDIART 220 Visual Anthropology 4 MEDIART 223 Shot by Shot: Concept and Frame Composition 4 Choose two of the following 300-400 level courses MEDIART 301 Experimental Filmmaking 4 MEDIART 305 [42] Advanced Documentary Practice 4 MEDIART 310 Screenwriting 4 MEDIART 311 Cinematography 4 MEDIART 323 [43] Sound Design and Music for Film 4 MEDIART 498 Special Topics in Film & Documentary 4 [40] This course was named MEDIART 110 Audio Documentary and Storytelling prior to fall term 2023. [41] This course was named MEDIART 207 Creative Writing and the Elements of Story prior to fall term 2023. [42] This course was named MEDIART 305 Producing Docu-fiction prior to fall term 2023. [43] This course was named MEDIART 218 Music and Cinema prior to fall term 2023. Studio & Performance Course Code Course Name Course Credit Choose two of the following 100-200 level courses LIT 216 Introduction to Creative Writing and Translation 4 MEDIART 104 Introduction to Photography 4 MEDIART 117 Studio Drawing and Animation 4 MEDIART 118 Introduction to Dance and Choreography 4 MEDIART 120 [44] Introduction to Theatre and Performance Studies 4 MEDIART 198 Special Topics in Creative Practice 4 MEDIART 221 Introduction to Composition 4 MEDIART 222 Electronic Sound: Sampling and Synthesis 4 MEDIART 225 [45] Fundamentals of Tonal Music Theory 4 Choose two of the following 300-400 level courses LIT 311 Poetry in Conversation 4 MEDIART 301 Experimental Filmmaking 4 MEDIART 322 Installation Art 4 MEDIART 323 [46] Sound Design and Music for Film 4 MEDIART 324 [47] The Photographic Essay 4 HUM 405/MEDIART 405 The Curatorial: Theory and Practice 4 [44] Thiscourse was numbered and named MEDIART 216 Performance, Embodiment, and Cultural Memory prior to fall term 2023. [45] This course was numbered and named MEDIART 115 Introduction to Music Theory prior to fall term 2023",
      "metadata": {
        "file_name": "arts_&_media_major_with_tracks_in_arts_and_media_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Arts and Media/Media"
      }
    },
    {
      "text": ". [46] This course was named MEDIART 218 Music and Cinema prior to fall term 2023. [47] This course was numbered MEDIART 204 The Photographic Essay prior to fall term 2023. Digital Culture & Communication Course Code Course Name Course Credit Choose two of the following 100-200 level courses INFOSCI 105 Experimental Interface Design 4 INFOSCI 202 3D Modelling and Animation 4 MEDIART 110 [48] Audio Documentary and the Podcast 4 MEDIART 202 [49] Creativity and Entrepreneurship 4 MEDIART 205 Digital Imaging and Graphic Design 4 MEDIART 207 [50] Elements of Story: Introduction to Narrative Structure 4 MEDIART 212 Editing for the Video Essay 4 MEDIART 213 [51] Web-Based Multimedia Design 4 Choose two of the following 300-400 level courses LIT 307 Digital Storytelling 4 INFOSCI 305 Virtual Museums and Digital Cultural Heritage 4 INFOSCI 309 Speculative and Critical Design 4 MEDIART 312 Graphic Design in Motion 4 MEDIART 321 Practices in Digital Humanities 4 MEDIART 401 Campaigns, Marketing, and Persuasion 4 [48] This course was named MEDIART 110 Audio Documentary and Storytelling prior to fall term 2023. [49] The course was named MEDIART 202 Ideas, Imagination, and Creativity prior to fall term 2023. [50] This course was named MEDIART 207 Creative Writing and the Elements of Story prior to fall term 2023. [51] This course was named MEDIART 213 Foundations of Web-Based Multimedia Communications prior to fall term 2023. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "arts_&_media_major_with_tracks_in_arts_and_media_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Arts and Media/Media"
      }
    }
  ],
  "Global China Studies": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 101 Foundational Questions in Social Science 4 ARHU 101 The Art of Interpretation: Written Texts 4 Interdisciplinary Courses Course Code Course Name Course Credit GCHINA 108 From Empire to Nation 4 GCHINA 205 Modern Chinese Politics 4 GCHINA 305 Visual China 4 GCHINA 390 Arts of China 4 GCHINA 490 China’s Economic Transition 4 Disciplinary Courses Course Code Course Name Course Credit GCHINA 202 Modern Chinese Politics 4 GCHINA 304 [86] US/China Relations 4 GCHINA 306 Traditions of Power: Historical Origins of Modern China 4 For Chinese learners, [87] demonstrate proficiency in Chinese language by completing the following courses [88] 4 CHINESE 402A Advanced Chinese – Issues in Modern China 2 – A 2 CHINESE 402B Advanced Chinese – Issues in Modern China 2 – B 2 And choose one of the following courses 4 HIST 201 History Methods and Research 4 SOSC 102 Introduction to Research Methods 4 SOSC 206 Qualitative Research Methods 4 STATS 101 Introduction to Applied Statistical Methods 4 And a minimum of three courses from at least two of the following categories, including one course at the 300-level or above. Students exempt from CHINESE 402B and 402B must complete four courses 4 Chinese Arts and Letters 4 ARTS 217/HIST 217 Arts of China 4 GCHINA 203/ART 203 Visual China: Modern Chinese History and Culture through Film 4 LIT 223/CHINESE 423 Topics in Modern and Premodern Chinese Literature 4 MEDIART 208 Chinese Mass Media 4 China’s Global Engagements 4 POLSCI 303 International Politics of East Asia 4 POLSCI 398-2 Special Topics in Chinese International Relations 4 POLSCI 316 Sino-African Relations in History and Present 4 POLECON 302/GCHINA 301 China’s Economic Transition 4 Chinese History and Thought 4 PHIL 226/HIST 226 [89] History of Chinese Philosophy 4 HIST 301 SChina and the Silk Roads World: 500-1500 4 RELIG 302 Chinese Religion and Philosophical Thought on the Environment 4 GCHINA 204 Politics of Art and the Art of Politics in China 4 Suzhou and the Jiangnan Region 4 GCHINA 206 History of Suzhou 4 HIST 205 Shanghai: From Treaty Port to Metropolis 4 CULANTH 206 [90] China Stories: Local Cultures and Communities 4 LIT 310 Translating Kunqu for the Global Stage 4 [86] [87] [88] [89] [90] China is at the forefront of global change, and this major prepares you to engage meaningfully with its future. Through rigorous training in cultural and intercultural competency, historical understanding, and analysis of contemporary society, you’ll be equipped to lead in contexts where a deep knowledge of China is essential. Conversely, understanding how the world sees China is just as important a skill and a lens through which to reflect on its culture and history. Drawing on the university’s location in Jiangnan (the historically rich region south of the lower Yangtze), an interdisciplinary curriculum, and the wide-ranging expertise of its faculty, Global China Studies at DKU provides students with a clear, grounded approach to studying China from both within and outside",
      "metadata": {
        "file_name": "global_china_studies_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Global China Studies"
      }
    },
    {
      "text": ". The program’s structure enables our students to integrate fieldwork, language acquisition, and critical thinking in ways no other place can match. While the major is intellectually located in the twenty-first century and content highly relevant to modern China, it also draws from elements of China’s earlier periods that are crucial to understanding China today and to illuminating pressing twenty-first century challenges. This includes the formation of China’s modern borders under the Qing Empire, China’s role in pre-twentieth century global trade, the Qing Empire’s responses to rebellion and reform, the long tradition of the centralizing state in China, and a history of economic revolutions and interventions in the environment dating back more than a thousand years. Graduates of this major can pursue advanced degrees focusing across the humanities and social sciences",
      "metadata": {
        "file_name": "global_china_studies_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Global China Studies"
      }
    },
    {
      "text": ". They will be especially well-prepared for graduate degrees related to China and work in a wide range of jobs where knowledge of China and Chinese is an advantage, including government work, the NGO world, as well as higher education and the private sector, particularly in global companies and educational joint ventures with operations in China. This course was named POLSCI 221 US/China Relations prior to Fall 2025. Chinese learners intending to pursue Global China Studies can be accelerated through the Chinese Language sequence by placing out of certain classes and/or attending an approved summer immersion program. Consult the Major Convenor for Global China Studies or the Director of Chinese as a Second Language (CSL) for more details. Students who attended a Chinese-language high school are exempt from this requirement; if you are unsure, please contact the Major Convener for Global China Studies. This course was named PHIL 102/HIST 101 Ancient Chinese History and Philosophy before Fall 2025",
      "metadata": {
        "file_name": "global_china_studies_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Global China Studies"
      }
    },
    {
      "text": ". This course was named CULANTH 206 Ethnography of China: New Directions prior to Fall 2025. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "global_china_studies_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Global China Studies"
      }
    }
  ],
  "Humanities / Creative Writing and Translation": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit ARHU 101 The Art of Interpretation: Written Text 4 ARHU 102 The Art of interpretation: Images and Sound 4 Interdisciplinary Courses Course Code Course Name Course Credit HUM 105 [99] Text, Translation, and Storytelling 4 HUM 202 [100] Empires and Culture 4 HUM 205 [101] Texts in Motion 4 HUM 301 Superstories: Narratives that Shaped the World 4 HUM 302 [102] Gender in Global Perspective 4 HUM 490 Senior Seminar in Humanities 4 [99] This course was named GCULS 105 Critical Comparative Studies prior to Fall 2025. [100] This course was named GCULS 202 Empires and Culture prior to Fall 2025. [101] This course was named GCULS 205 Texts in Motion prior to Fall 2025. [102] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. Disciplinary Courses Course Code Course Name Course Credit LIT 216 Introduction to Creative Writing and Translation 4 Students are required to take an additional 20 credits from the two lists below, with at least 8 credits from each list. At least 8 of these credits must be 300-level or above. Other electives offered at Duke and DKU may meet these requirements: please approach the relevant major convener with any questions. : List 1: choose at least 8 credits from the list below, which focuses on the context, audience reception and networks of publishing. : LIT 223/CHINESE 423 Topics in Modern and Premodern Chinese Literature 4 LIT 219 / MEDIART 219 Stage Translation for Kunqu 2 LIT 310 Translating Kunqu for the Global Stage 4 LIT 315 Translation Theory 4 WOC 207 / CHINESE 408 Translation Workshop 2 WOC 210 Translation Workshop: Adaptation and Transformation 2 WOC 213 From Text to World: Editing and Publishing 2 WOC 216 Introduction to Feature Writing 2 WOC 217 Introduction to News Writing 2 HUM 405 / MEDIART 405 The Curatorial: Theory and Practice 4 List 2: choose at least 8 credits from the list below, which focuses on developing authorial voice and genre awareness. LIT 220 Line Breaks and Chapbooks: Poetry Workshop 4 LIT 311 Poetry in Conversation 4 LIT 314 Big Stories: Fiction and Non-Fiction Workshop 4 MEDIART 110 Audio Documentary and the Podcast 4 MEDIART 207 Elements of Story: Introduction to Narrative Technique 4 MEDIART 310 Screenwriting 4 WOC 108 Intercultural Communication 2 WOC 190 Creative Nonfiction: People and Places 2 WOC 214 / CHINESE 414 Reading Chinese Love Stories in Novels and Memoirs 2 WOC 290 Special Topics: Writing Across Cultures 4 HIST 314 Writing the History of War 4",
      "metadata": {
        "file_name": "humanities_with_tracks_in_creative_writing_and_translation,_literature,_philosophy_and_religion,_and_world_history_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Humanities / Creative Writing and Translation"
      }
    }
  ],
  "Humanities / Literature": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit ARHU 101 The Art of Interpretation: Written Text 4 ARHU 102 The Art of interpretation: Images and Sound 4 Interdisciplinary Courses Course Code Course Name Course Credit HUM 105 [103] Text, Translation, and Storytelling 4 HUM 202 [104] Empires and Culture 4 HUM 205 [105] Texts in Motion 4 HUM 301 Superstories: Narratives that Shaped the World 4 HUM 302 [106] Gender in Global Perspective 4 HUM 490 Senior Seminar in Humanities 4 [103] This course was named GCULS 105 Critical Comparative Studies prior to Fall 2025. [104] This course was named GCULS 202 Empires and Culture prior to Fall 2025. [105] This course was named GCULS 205 Texts in Motion prior to Fall 2025. [106] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. Disciplinary Courses Course Code Course Name Course Credit LIT 214 Introduction to Literary Research 4 Students are required to take an additional 5 courses from the two lists below, with at least 2 courses from each list. At least 2 of these 5 courses must be 300-level or above. Other electives offered at Duke and DKU may meet these requirements: please approach the relevant major convener with any questions. List 1: choose 2 courses from the list below, which focuses on literary traditions specific to a time, place, or language. LIT 298-1 Special Topics in U.S. Literature 4 LIT 298-2 Special Topics in Literary Traditions 4 LIT 216 Introduction to Creative Writing and Translation 4 LIT 223 / Chinese 423 Topics in Modern and Premodern Chinese Literature 4 LIT 311 Poetry in Conversation 4 LIT 314 Big Stories: Fiction and Non-Fiction Workshop 4 LIT 310 Translating Kunqu for the Global Stage 4 List 2: choose 2 courses from the list below, which focuses on broad thematic and comparative analysis. LIT 203 Reading Empire 4 LIT 210 Writing Machines: Literature, Technology, and the Future 4 RELIG 221/LIT 221 [107] Comparing Religions: Text, Orality, and Myth 4 LIT 398 Special Topics in World Literature 4 LIT 315 Translation Theory 4 HUM 405 / MEDIART 405 The Curatorial: Theory and Practice 4 [107] This course was named RELIG 101 Comparative Religious Studies prior to Fall 2025.",
      "metadata": {
        "file_name": "humanities_with_tracks_in_creative_writing_and_translation,_literature,_philosophy_and_religion,_and_world_history_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Humanities / Literature"
      }
    }
  ],
  "Humanities /Philosophy and Religion": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit ARHU 101 The Art of Interpretation: Written Text 4 ARHU 102 The Art of interpretation: Images and Sound 4 Interdisciplinary Courses Course Code Course Name Course Credit HUM 105 [108] Text, Translation, and Storytelling 4 HUM 202 [109] Empires and Culture 4 HUM 205 [110] Texts in Motion 4 HUM 301 Superstories: Narratives that Shaped the World 4 HUM 302 [111] Gender in Global Perspective 4 HUM 490 Senior Seminar in Humanities 4 [108] This course was named GCULS 105 Critical Comparative Studies prior to Fall 2025. [109] This course was named GCULS 202 Empires and Culture prior to Fall 2025. [110] This course was named GCULS 205 Texts in Motion prior to Fall 2025. [111] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. Disciplinary Courses Course Code Course Name Course Credit HUM 201 Research in Philosophy and Religion 4 Students are required to take an additional 5 courses from the lists below, with at least 2 courses from each list. At least 2 of these 5 courses have to be 300-level or above. Other electives offered at Duke and DKU may meet these requirements: please approach the relevant major convener with any questions. List 1: Choose at least one PHIL course and one RELIG course from the list below, which focuses on specific traditions, times, or places. PHIL 210 [112] Special Topics in U.S. Literature 4 PHIL 226/HIST 226 [113] History of Chinese Philosophy 4 RELIG 203 History of God 4 RELIG 302 Topics in Modern and Premodern Chinese Literature 4 List 2: Choose at least one PHIL course and one RELIG course from the list below, which focuses on broad thematic and comparative analysis. RELIG 221/LIT 221 [114] Comparing Religions: Text, Orality, and Myth 4 PHIL 305 Cross-Cultural Philosophy 4 PHIL 398 Special Topics in Philosophy 4 RELIG 398 Special Topics in Religion 4 [112] This course was named PHIL 101 History of Western Philosophy prior to Fall 2025. [113] This course was named PHI 102/HIST 101 Ancient Chinese History and Philosophy prior to Fall 2025. [114] This course was named RELIG 101 Comparative Religious Studies prior to Fall 2025.",
      "metadata": {
        "file_name": "humanities_with_tracks_in_creative_writing_and_translation,_literature,_philosophy_and_religion,_and_world_history_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Humanities /Philosophy and Religion"
      }
    }
  ],
  "Humanities /World History": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit ARHU 101 The Art of Interpretation: Written Text 4 ARHU 102 The Art of interpretation: Images and Sound 4 Interdisciplinary Courses Course Code Course Name Course Credit HUM 105 [115] Text, Translation, and Storytelling 4 HUM 202 [116] Empires and Culture 4 HUM 205 [117] Texts in Motion 4 HUM 301 Superstories: Narratives that Shaped the World 4 HUM 302 [118] Gender in Global Perspective 4 HUM 490 Senior Seminar in Humanities 4 [115] This course was named GCULS 105 Critical Comparative Studies prior to Fall 2025. [116] This course was named GCULS 202 Empires and Culture prior to Fall 2025. [117] This course was named GCULS 205 Texts in Motion prior to Fall 2025. [118] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. Disciplinary Courses Course Code Course Name Course Credit HIST 201 History Methods and Research 4 Students are required to take an additional 5 courses from the two lists below, with at least 2 courses from each list. At least 2 of these 5 courses must be 300-level or above. Other electives offered at Duke and DKU may meet these requirements: please approach the relevant major convener with any questions. List 1: choose at least 2 courses from the following list, which focuses on broad historical trends and analysis. HIST 111 Ancient Roots to Global Routes 4 HIST 212 Pandemics in World History 4 HIST 228 Power, Technology, and the Environment 4 HIST 233/RELIG 203 History of God 4 HIST 309 Global Commodities and Their Discontents 4 HIST 401 Special Topics: Global connections 4 List 2: choose at least 2 courses from the following list, which focuses on local, national, and regional histories. HIST 227 The Global Economy in History 4 HIST 229 Labor, Migration, and the Making of the Modern World 4 HIST 230 The History of Everyday Life 4 HIST 314 Writing the History of War and Peace 4 HIST 217/ARTS 217 Arts of China 4 HIST 402 Confluences: Histories of Rivers, Oceans, and the Environment 4 [112] This course was named PHIL 101 History of Western Philosophy prior to Fall 2025. [113] This course was named PHI 102/HIST 101 Ancient Chinese History and Philosophy prior to Fall 2025. [114] This course was named RELIG 101 Comparative Religious Studies prior to Fall 2025. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "humanities_with_tracks_in_creative_writing_and_translation,_literature,_philosophy_and_religion,_and_world_history_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Humanities /World History"
      }
    }
  ],
  "Behavioral Science / Psychology": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit BIOL 110 Integrated Science – Biology 4 SOSC 101 Foundational Questions in Social Science 4 STATS 101* Introduction to Applied Statistical Methods 4 And choose one from the following two courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 * Students who are more interested in computational modeling can choose MATH 206 as a substitute for STATS 101. Interdisciplinary Courses Course Code Course Name Course Credit BEHAVSCI 101 Introduction to Behavioral Science 4 BEHAVSCI 102 Mechanisms of Human Behavior 4 BEHAVSCI 201 Individuals and Their Decisions 4 BEHAVSCI 202 Institutions, Groups, and Society 4 BEHAVSCI 401 Moving Beyond Nudges 4 Disciplinary Courses Course Code Course Name Course Credit PSYCH 101 Introductory Psychology 4 BEHAVSCI 402 Judgement and Decision Making 4 And choose three courses total from Course Clusters I and II, with at least one course from each cluster Course Cluster I PSYCH 202 Cognitive Psychology 4 PSYCH 203 Developmental Psychology 4 PSYCH 204 Social Psychology 4 Course  Cluster II NEUROSCI 102 Biological Basis of Behavior 4 PSYCH 205 Abnormal Psychology 4 NEUROSCI 212 Cognitive Neuroscience 4 Electives Course Code Course Name Course Credit Applied Behavioral Science Electives SOSC 204 Business Ethics 4 ECON 309 Behavioral Finance 4 ECON 333/      SOSC 333 Social and Economic Networks 4 PUBPOL 303 Policy Choice as Value Conflict 4 ETHLDR 303/ BEHAVSCI 303 Organizational Behavior 4 ETHLDR 301 Ethics of Nudging 4 Psychology Electives POLSCI 313 /PSYCH 313 Political Psychology 4 PSYCH 110 Mindfulness, Stress, and Health: Eastern and Western Perspectives 4 PSYCH 405 Conceptual Issues & Critical Debates in Psychology 4 BEHAVSCI 203 Comparative Analysis of Behavior 4 POLSCI 317/ SOSC 317 Politics of Organization 4 Neuroscience Electives NEUROSCI 202 Medical Neuroscience 4 Methodology Electives GLHLTH 301 Global Health Research Methods 4 PSYCH 304 Quantitative Research Methods and Statistics for Psychological Science 4 BEHAVSCI 204 Experimental Philosophy 4 INTGSCI 205 Integrated Science – Research Methods and Science Communication 4",
      "metadata": {
        "file_name": "behavioral_science_with_tracks_in_economics,_psychology_and_neuroscience_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Behavioral Science / Psychology"
      }
    }
  ],
  "Behavioral Science / Neuroscience": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit BIOL 110 Integrated Science – Biology 4 SOSC 101 Foundational Questions in Social Science 4 STATS 101* Introduction to Applied Statistical Methods 4 And choose one from the following two courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 * Students who are more interested in computational modeling can MATH 206 as a substitute for STATS 101. Interdisciplinary Courses Course Code Course Name Course Credit BEHAVSCI 101 Introduction to Behavioral Science 4 BEHAVSCI 102 Mechanisms of Human Behavior 4 BEHAVSCI 201 Individuals and Their Decisions 4 BEHAVSCI 202 Institutions, Groups, and Society 4 BEHAVSCI 401 Moving Beyond Nudges 4 Disciplinary Courses Course Code Course Name Course Credit NEUROSCI 102 Biological Basis of Behavior 4 BEHAVSCI 205 Systems and Circuits 4 NEUROSCI 212 Cognitive Neuroscience 4 NEUROSCI 301 Research Methods in Neuroscience 4 BEHAVSCI 301 Computational Neuroscience 4 Electives Courses listed in the table below are recommended electives for the major. The course list reflects the most recent intellectual organization of major electives. Depending on the academic year in which you matriculated, some of the courses below may be requirements for your major. To verify required courses, always consult the requirements for the relevant class year in the bulletin of the year in which you matriculated unless you have been approved to complete the major requirements of a subsequent year. (See Ability to Meet Major Requirements Published in Years Subsequent to Year of Matriculation.) Course Code Course Name Course Credit Applied Behavioral Science Electives SOSC 204 Business Ethics 4 ECON 309 Behavioral Finance 4 ECON 333/      SOSC 333 Social and Economic Networks 4 PUBPOL 303 Policy Choice as Value Conflict 4 ETHLDR 303/ BEHAVSCI 303 Organizational Behavior 4 ETHLDR 301 Ethics of Nudging 4 Psychology Electives POLSCI 313 /PSYCH 313 Political Psychology 4 PSYCH 110 Mindfulness, Stress, and Health: Eastern and Western Perspectives 4 PSYCH 405 Conceptual Issues & Critical Debates in Psychology 4 BEHAVSCI 203 Comparative Analysis of Behavior 2 Neuroscience Electives NEUROSCI 202 Medical Neuroscience 4 Methodology Electives GLHLTH 301 Global Health Research Methods 4 PSYCH 304 Quantitative Research Methods and Statistics for Psychological Science 4 BEHAVSCI 204 Experimental Philosophy 4 INTGSCI 205 Integrated Science – Research Methods and Science Communication 4 Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "behavioral_science_with_tracks_in_economics,_psychology_and_neuroscience_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Behavioral Science / Neuroscience"
      }
    }
  ],
  "Computation and Design / Computer Science": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one of the courses below MATH 206 Probability and Statistics 4 And choose one of the following two courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And choose one of the following three courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit Choose one of the following two courses COMPSCI 101 Introduction to Computer Science 4 STATS 102 Introduction to Data Science 4 And complete the following courses INFOSCI 102 Computation and Problem Solving 4 INFOSCI 103 Computation, Society & Culture 4 INFOSCI 104 / MEDIA 104 Digital Design 4 STATS 202 Modeling and Predicting 4 COMPDSGN 490 Senior Seminar 4 Disciplinary Courses Course Code Course Name Course Credit COMPSCI 201 Introduction to Programming and Data Structures 4 COMPSCI 203 Discrete Math for Computer Science 4 COMPSCI 205 Computer Organization and Programming 4 COMPSCI 308 Design and Analysis of Algorithms 4 And choose one from the following three courses COMPSCI 306 Introduction to Operating Systems 4 COMPSCI 310 Introduction to Databases 4 COMPSCI 311 Computer Network Architecture 4 Electives Course Code Course Name Course Credit COMPSCI 204 Introduction to Artificial Intelligence 4 INTGSCI 205 Integrated Science – Research Methods and Science Communication 4 INFOSCI 206 Urban Data Visualization and Communication Methods 2 COMPSCI 210 Everything Data 4 ECON 211 Intelligent Economics: An Explainable AI approach 2 COMPSCI 302 Computer Vision 4 INFOSCI 302 Introduction to Geographical Information Science 4 COMPSCI 303 Search Engines 4 COMPSCI 304 Speech Recognition 4 COMPSCI 307 Software Design and Implementation 4 STATS 302/ COMPSCI 309 Principles of Machine Learning 4 COMPSCI 320 Software Reliability 4 COMPSCI 401 Cloud Computing 4 STATS 401 Data Acquisition and Visualization 4 COMPSCI 402 Artificial Intelligence 4 STATS 402 Interdisciplinary Data Analysis 4 STATS 403 Deep Learning 4",
      "metadata": {
        "file_name": "computation_and_design_with_tracks_in_computer_science,_digital_media,_and_social_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Computation and Design / Computer Science"
      }
    }
  ],
  "Computation and Design / Digital Media": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one of the following two courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And choose one of the following two courses ARHU101 The Art of Interpretation: Written Texts 4 ARHU102 The Art of Interpretation: Image and Sound 4 And complete the following course STATS 101 Introduction to Applied Statistical Methods 4 Interdisciplinary Courses Course Code Course Name Course Credit Choose one of the following two courses COMPSCI 101 Introduction to Computer Science 4 STATS 102 Introduction to Data Science 4 And complete the following courses INFOSCI 102 Computation and Problem Solving 4 INFOSCI 103 Computation, Society & Culture 4 INFOSCI 104 / MEDIA 104 Digital Design 4 STATS 202 Modeling and Predicting 4 COMPDSGN 490 Senior Seminar 4 Disciplinary Courses Course Code Course Name Course Credit Complete the following two courses MEDIART 206 Computer Graphics 4 INFOSCI 301 Data Visualization and Information Aesthetics 4 And choose three of the following seven domain courses INFOSCI 201 Interaction & Physical Computing 4 INFOSCI 202 3D Modeling and Animation 4 INFOSCI 304 Game Engine Programming and Immersive Media 4 INFOSCI 309 Speculative and Critical Design 4 MEDIART 306 Foundations of Interactive Game Design 4 Electives Course Code Course Name Course Credit INFOSCI 105 Experimental Interface Design 4 COMPSCI 201 Introduction to Programming and Data Structures 4 STATS 201 Introduction to Machine Learning for Social Science 4 GCULS 201/ CULANTH 202/MEDIA 202 Culture and Industry 4 INFOSCI 206 Urban Data Visualization and Communication Methods 2 MEDIART 208 [55] Chinese Mass Media 4 COMPSCI 210 Everything Data 4 MEDIART 211 Media, Arts, and Critical Theory 4 POLSCI 302 Public Opinion 4 INFOSCI 302 Introduction to Geographical Information Science 4 LIT 307 Digital Storytelling 4 MEDIA 203 [56] Global Media and Communication 4 INFOSCI 308 Data and Visualization 4 SOSC 314 Computational Social Science: Tools to Collect & Analyze Human Behavior Using Data from the Internet 4 SOSC 315 Urban Sociology 4 MEDIART 213 [57] Web-Based Multimedia Design [55] This course was named MEDIART 208 Comparative Media Systems and Chinese Mass Media prior to fall term 2023. [56] This course was named and numbered MEDIART 307 International Communication prior to the fall 2023 term [57] This course was named MEDIART 213 Foundations of Web-Based Multimedia Communications prior to fall term 2023.",
      "metadata": {
        "file_name": "computation_and_design_with_tracks_in_computer_science,_digital_media,_and_social_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Computation and Design / Digital Media"
      }
    }
  ],
  "Computation and Design / Social Policy": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one of the following two courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses STATS 101 Introduction to Applied Statistical Methods 4 SOSC101 Foundational Questions in Social Science 4 Interdisciplinary Courses Course Code Course Name Course Credit Choose one of the following two courses COMPSCI 101 Introduction to Computer Science 4 STATS 102 Introduction to Data Science 4 And complete the following courses INFOSCI 102 Computation and Problem Solving 4 INFOSCI 103 Computation, Society & Culture 4 INFOSCI 104 / MEDIA 104 Digital Design 4 STATS 202 Modeling and Predicting 4 COMPDSGN 490 Senior Seminar 4 Disciplinary Courses Course Code Course Name Course Credit Choose 2 Methods Courses from the list below STATS 201 Introduction to Machine Learning for Social Science 4 COMPSCI 206/ ECON 206 Computational Microeconomics 4 INFOSCI 302 Introduction to Geographic Information Systems 4 SOSC 314 Computational Social Science: Tools to Collect & Analyze Human Behavior Using Data from the Internet 4 SOSC 320 [58] Data in the World: Applied Social Statistics 4 And choose 3 Concentration Courses from one of the 3 Concentrations listed below Urban Design Concentration Courses PUBPOL 204 Governing Cities 4 ECON 310 Urban Economics 4 INFOSCI 305 Virtual Museums and Digital Culture Heritage 4 SOSC 315 Urban Sociology 4 SOSC 405 The Future of the City 4 Environmental Sustainability Concentration Courses ENVIR 101 Introduction to Environmental Science 4 ENVIR 201 Applied Environmental Science and Policy 4 ENVIR 203 Theory and Practice of Sustainability 4 EHTLDR 204 Environmental Ethics 4 ENVIR 206 Energy and the Environment 4 ENVIR 301 International Environmental Policy 4 ENVIR 302/ ECON 302 Environmental Economics & Policy 4 ENVIR 303 Climate Change and Society in China 4 Global Networks Concentration Courses CULANTH 213 [59] Globalization, Sustainability, and Technology 4 POLSCI 101 International Politics 4 HIST 111 Ancient Roots to Global Routes 4 POLECON 201 International Political Economy 4 MEDIA 203 Global Media and Communications 4 ENVIR 303 Climate Change and Society in China 4 HIST 212 Pandemics in World History from the Black Death to COVID-19 4 GLHLTH 310 Global Disease Control Programs 4 ECON 314 International Trade 4 ECON 333/ SOSC 333 Social and Economic Networks 4 POLSCI 309 Networks in a Globalizing World 4 [58] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. [59] This course was named and numbered CULMOVE 101Cultures of Globalization prior to Fall 2025. Electives Course Code Course Name Course Credit Urban Design GCULS 106 Our Cities and Ourselves 2 PUBPOL 106 Urbanizing China: Spatial and Social Dynamics in Chinese Cities 2 HIST 205 Shanghai: From Treaty Port to Global Metropolis 4 INFOSCI 206 Urban Data Visualization and Communication Methods 2 SOCIOL 206 Reshaping Global Urbanization 4 CULSOC 201 Social Inequalities 4 POLSCI 215 The Political History of Modern Architecture: From Revolution through Neoliberalism 4 GCULS 303 Chinatowns: A Cultural History 4 POLSCI 307 Political Economy of Institutions 4 INFOSCI 302 Introduction to Geographical Information Science 4 Environmental Sustainability INFOSCI 206 Urban Data Visualization and Communication Methods 2 INFOSCI 302 Introduction to Geographical Information Science 4 ECON 311 Economic Analysis of Current Energy Issues 4 ENVIR 401 Energy and Environment Design 4 ENVIR 404/ ECON 404 Environmental Justice: The Economics of Race, Place and Pollution 4 Global Networks HIST 123 All Around Us – Technology, Infrastructure, and History 2 CULANTH 314/POLSCI 314 [60] Migration, the State, and Refugees 4 INFOSCI 206 Urban Data Visualization and Communication Methods 2 CULANTH 213 [61] Globalization, Sustainability, and Technology 4 LIT 209 Critical Inter-Asia: Rethinking Local and Global Connections 4 CULANTH  209 Globalization and Alternative-Globalizations 4 HUM 302 [62] Gender in Global Perspective 4 INFOSCI 302 Introduction to Geographical Information Science 4 MEDIA 203 [63] Global Media and Communication 4 ECON 307 History of Monetary & International Crises 4 ECON 333/ SOSC 333 Social and Economic Networks 4 ECON 402 International Finance 4 [60] This course was named CULANTH/POLSCI 314 Refugees and the Biopolitics of Citizenship prior to Fall 2025. [61] This course was named and numbered CULMOVE 101 Cultures of Globalization prior to Fall 2025. [62] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. [63] This course was named and numbered MEDIART 307 International Communication prior to fall 2023 term. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "computation_and_design_with_tracks_in_computer_science,_digital_media,_and_social_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Computation and Design / Social Policy"
      }
    }
  ],
  "Cultures and Societies / Cultural Anthropology": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 101 Foundational Questions in Social Science 4 SOSC 102 Introduction to Research Methods 4 Interdisciplinary Courses Course Code Course Name Course Credit CULSOC 101 Cultures and Societies 4 CULSOC 205/ RELIG 205 Religion and Power 4 CULSOC 201 Social Inequalities 4 CULSOC 301 Theories of Social Change 4 CULSOC 390 Junior Seminar 4 CULSOC 490 Senior Seminar 4 Cultural Anthropology Disciplinary Courses Course Code Course Name Course Credit CULANTH 101 Introduction to Cultural Anthropology 4 CULANTH  210 [64] Ethnographic Field Methods 4 CULANTH  304 Rethinking Progress: Capitalism and Its Alternatives 4 CULANTH  398 Advanced Topics in Cultural Anthropology 4 And choose two courses from the following five courses, with at least one at the 300-level or above CULANTH  211 [65] Race, Gender, and Labor in the City 4 CULANTH  213 [66] Globalization, Sustainability, and Technology 4 CULANTH 314/POLSCI 314 [67] Migration, the State, and Refugees 4 CULANTH  405 [68] Bodies, Medicine, and Healing 4 GCHINA 305 Family and Society in China 4 [64] This course was numbered CULANTH 302 Ethnographic Field Methods prior to Fall 2025. [65] This course was named CULANTH 211 Gender, Mobility, and Labor prior to Fall 2025. [66] This course was named and numbered CULMOVE 101 Cultures of Globalization prior to Fall 2025. [67] This course was named CULANTH/POLSCI 314 Refugees and the Biopolitics of Citizenship prior to Fall 2025. [68] This course was named CULANTH 405 Medical Anthropology prior to fall 2025. Electives Course Code Course Name Course Credit CULANTH 107 Food, Ethnicity, and Globalization 2 CULMOVE 115 Displacement and Identity 2 CULANTH 106 Home, House, Housing: Anthropological Exploration of Human Dwellings 2 RELIG 206 Shamanism, Animism, and Indigeneity 2 CULANTH/MEDIA 202 Culture and Industry 4 CULANTH/MEDIA 207 Cultures of New Media 4 CULANTH 206 [69] China Stories: Local Cultures and Communities 4 SOCIOL 101 Introduction to Sociology 4 SOCIOL 102 Sociology of Culture 4 SOCIOL 305 Theory and Society 4 HUM 302 [70] Gender in Global Perspective 4 HIST 228 Power, Technology, and the Environment 4 GCHINA 204 Politics of Art and the Art of Politics in China 4 HUM 405/MEDIART 405 The Curatorial: Theory and Practice 4 CULANTH 298 Special Topics in Anthropology 4 ETHILDR 202 Ethics, Markets, and Politics 4 PPE 303 [71] Conceptions of Democracy and Meritocracy 4 POLSCI 223 Power and Justice in the History of Political Thought 4 PHIL 309 Philosophy of the Social Sciences 4 POLECON 301 Development 4 [69] This course was named CULANTH 206 Ethnography of China: New Directions prior to Fall 2025. [70] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. [71] This course was named ETHLDR 203 Conceptions of Democracy and Meritocracy prior to Fall 2025.",
      "metadata": {
        "file_name": "cultures_and_societies_with_tracks_in_cultural_anthropology_and_sociology_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Cultures and Societies / Cultural Anthropology"
      }
    }
  ],
  "Cultures and Societies / Sociology": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 101 Foundational Questions in Social Science 4 SOSC 102 Introduction to Research Methods 4 Interdisciplinary Courses Course Code Course Name Course Credit CULSOC 101 Cultures and Societies 4 CULSOC 205/ RELIG 205 Religion and Power 4 CULSOC 201 Social Inequalities 4 CULSOC 301 Theories of Social Change 4 CULSOC 390 Junior Seminar 4 CULSOC 490 Senior Seminar 4 Sociology Disciplinary Courses Course Code Course Name Course Credit SOCIOL 101 Introduction to Sociology 4 STATS 101 Introduction to Applied Statistical Methods 4 SOCIOL 305 Theory and Society 4 And choose choose one of these three courses SOSC 205 [72] Linear Regressions: Introduction to Econometrics 4 SOSC 206 Qualitative Research Methods 4 SOSC 314 Computational Social Science 4 And choose two of these six courses, with at least one at the 200-level and one at the 300-level SOCIOL 202 Sociology of Culture 4 SOCIOL 213 Family, Work, and Inequality 4 SOCIOL/PUBPOL 223 [73] Comparative Educational Systems 4 SOCIOL 310 Gender and Society 4 SOSC 315 Urban Sociology 4 SOCIOL 380 History of Environmental Social Movements 4 [72] This course was named ECON 203 Introduction to Econometrics prior to Fall 2025. [73] This course was named and numbered SOCIOL/PUBPOL/SOSC 309 Education, Policy, and Society prior to Fall 2025. Electives Course Code Course Name Course Credit SOCIOL 298 Special Topics in Sociology 4 Social Inequalities CULANTH 211 [74] Race, Gender, and Labor in the City 4 CULANTH 213 [75] Globalization, Sustainability, and Technology 4 CULANTH/POLSCI 314 [76] Migration, the State, and Refugees 4 ECON/SOSC 333 Social and Economic Networks 4 GLHLTH 205 Social Determinants of Health 4 HIST 110 Historical Perspectives on Contemporary Global Issues 4 PUBPOL 204 Governing Cities 4 Institutions CULANTH 304 Rethinking Progress: Capitalism and Its Alternatives 4 GCHINA 305 Family and Society in China 4 POLSCI 308 Global Governance 4 GLHLTH 303 Global Comparative Health Systems 4 GLHLTH 304 Global Health Governance and Policy 4 MEDIA 203 Global Media and Communication 4 MEDIART 208 Chinese Mass Media 4 POLSCI 104 Comparative Politics and Institutions 4 SOSC 317/POLSCI 317 Politics of Organization 4 Culture and Society CULANTH/MEDIA 202 Culture and Industry 4 CULANTH/MEDIA 207 Cultures of New Media 4 GCHINA 205 Ideas Across Borders: China’s Intellectual Engagement with the World 4 GCHINA 204 Politics of Art and the Art of Politics in China 4 GCHINA/ARTS 203 Visual China: Modern Chinese History and Culture Through Film 4 HIST/ART 210 Global Art History 4 RELIG 201 Comparing Religions 4 RELIG 301 Religion and the Environment 4 RELIG 302 Modern Religion 4 HUM 202 [77] Empires and Cultures 4 HUM 302 [78] Gender in Global Perspective 4 Methods CULANTH 210 [79] Ethnographic Field Methods 4 PHIL 309 Philosophy of the Social Sciences 4 SOSC 302 [80] Research Designs for Causal Inference 4 SOSC 320 [81] Panel Data: Advanced Econometric Methods 4 [74] This course was named CULANTH 211 Gender, Mobility, and Labor prior to Fall 2025. [75] This course was named and numbered CULMOVE 101 Cultures of Globalization prior to Fall 2025. [76] This course was named CULANTH/POLSCI 314 Refugees and the Biopolitics of Citizenship prior to Fall 2025. [77] This course was named GCULS 202 Empires and Culture prior to Fall 2025. [78] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. [79] This course was numbered CULANTH 302 Ethnographic Field Methods prior to fall 2025. [80] This course was named POLSCI 301 Program Evaluation prior to Fall 2025",
      "metadata": {
        "file_name": "cultures_and_societies_with_tracks_in_cultural_anthropology_and_sociology_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Cultures and Societies / Sociology"
      }
    },
    {
      "text": ". [81] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "cultures_and_societies_with_tracks_in_cultural_anthropology_and_sociology_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Cultures and Societies / Sociology"
      }
    }
  ],
  "Data Science": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two calculus courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And choose two of the following courses (PHYS 121 is strongly recommended) BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 INTGSCI 205 Scientific Methods and Communications 4 Interdisciplinary Courses Course Code Course Name Course Credit COMPSCI 201 Introduction to Programming and Data Structures 4 STATS 302/COMPSCI 309 Principles of Machine Learning 4 STATS 303 Statistical Machine Learning 4 STATS 401 Data Acquisition and Visualization 4 STATS 402 Interdisciplinary Data Analysis 4 Disciplinary Courses Course Code Course Name Course Credit MATH 201 Multivariable Calculus 4 MATH 202 Linear Algebra 4 MATH 206 Probability and Statistics 4 STATS 211 Introduction to Stochastic Processes 4 COMPSCI 301 Algorithms and Databases 4 MATH 304 Numerical Analysis and Optimization 4 MATH 305 Advanced Linear Algebra 4 Electives Programming and Software Engineering COMPSCI 101 Introduction to Computer Science 4 COMPSCI 203 Discrete Math for Computer Science 4 COMPSCI 205 Computer Organization and Programming 4 COMPSCI 303 Search Engines 4 COMPSCI 306 Introduction to Operating Systems 4 COMPSCI 308 Design and Analysis of Algorithms 4 COMPSCI 310 Introduction to Databases 4 COMPSCI 311 Computer Network Architecture 4 COMPSCI 320 Software Reliability 4 COMPSCI 401 Cloud Computing 4 Machine Learning and AI STATS 102 Introduction to Data Science 4 STATS 304 Bayesian and Modern Statistics 4 COMPSCI 402 Artificial Intelligence 4 STATS 403 Deep Learning 4 STATS 404 Probabilistic Graphical Models 4 Signal Processing COMPSCI 207 Image Data Science 4 COMPSCI 302 Computer Vision 4 COMPSCI 304 Speech Recognition 4 Interdisciplinary Data Analytics ECON 211 Intelligent Economics: An Explainable AI approach 4 SOSC 320 [82] Data in the World: Applied Social Statistics 4 [82] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "data_science_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Data Science"
      }
    }
  ],
  "Environmental Science / Biogeochemistry": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit ENVIR 101 Introduction to Environmental Sciences 4 ENVIR 102 Dynamic Earth and Oceans: Physical and Biological Sciences for the Environment 4 ENVIR 201 Applied Environmental Science and Policy 4 choose one from the following two courses ENVIR 304 Environmental Chemistry and Toxicology 4 ENVIR 202 Biodiversity and Conservation 4 choose one from the following two courses ENVIR/ECON 302 Environmental Economics & Policy 4 ENVIR 301 International Environmental Policy 4 Disciplinary Courses Course Code Course Name Course Credit BIOL 208 General Ecology 4 BIOL 311/ ENVIR 311 Biogeochemistry 4 And choose one from the following two courses STATS 101 Introduction to Applied Statistical Methods 4 MATH 206 Probability and Statistics 4 And choose one from the following two courses BIOL 312 Ecophysiology 4 ENVIR 315/ CHEM 315 Aqueous Geochemistry 4 And choose one from the following three courses BIOL 313/ ENVIR 313 Ecosystem Service 4 BIOL 319 Global Change Biology 4 BIOL 405 Microbial Ecology 4 Electives Course Code Course Name Course Credit Ecosystem Science and Conservation BIOL 318 Food Web Ecology 4 BIOL 405 Microbial Ecology 4 ENVIR 202 Biodiversity and Conservation 4 BIOL 312 Ecophysiology 4 Water Resources ENVIR 310 Elements of Physical Hydrology 4 ENVIR 306 Water Pollution 4 ENVIR 315/ CHEM 315 Aqueous Geochemistry 4 Earth and Climate Sciences BIOL 319 Global Change Biology 4 ENVIR 310 Elements of Physical Hydrology 4 ENVIR 303 Climate Change and Society in China 4 PUBPOL 308 Managing the Oceans to Solve Global Problems 4 Methods SOSC 204 Business Ethics 4 INFOSCI 302 Introduction to Geographical Information Science 4 BIOL 314 Computational Biology and Bioinformatics 4 INTGSCI 205 Integrated Science – Research Methods and Science Communication 4",
      "metadata": {
        "file_name": "environmental_science_with_tracks_in_biogeochemistry,_biology,_chemistry,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Environmental Science / Biogeochemistry"
      }
    }
  ],
  "Environmental Science / Biology": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit ENVIR 101 Introduction to Environmental Sciences 4 ENVIR 102 Dynamic Earth and Oceans: Physical and Biological Sciences for the Environment 4 ENVIR 201 Applied Environmental Science and Policy 4 And choose one from the following two courses ENVIR 304 Environmental Chemistry and Toxicology 4 ENVIR 202 Biodiversity and Conservation 4 And choose one from the following two courses ENVIR/ECON 302 Environmental Economics & Policy 4 ENVIR 301 International Environmental Policy 4 Disciplinary Courses Course Code Course Name Course Credit BIOL 201 Cell and Molecular Biology 4 CHEM 201 Organic Chemistry I 4 BIOL 208 General Ecology 4 BIOL 212 Microbiology 4 BIOL 202 Genetics and Evolution 4 BIOL 305 Biochemistry 4 And choose one from the following two courses STATS 101 Introduction to Applied Statistical Methods 4 MATH 206 Probability and Statistics 4 Electives Courses listed in the table below are recommended electives for the major. The course list reflects the most recent intellectual organization of major electives. Depending on the academic year in which you matriculated, some of the courses below may be requirements for your major. To verify required courses, always consult the requirements for the relevant class year in the bulletin of the year in which you matriculated unless you have been approved to complete the major requirements of a subsequent year. (See Ability to Meet Major Requirements Published in Years Subsequent to Year of Matriculation.) Course Code Course Name Course Credit BIOL 203 Molecular, Behavioral and Social Evolution: Evolution of Genomes, Traits, Behaviors and Societies 4 SOSC 204 Business Ethics 4 GLHLTH 301 Global Health Research Methods 4 INFOSCI 302 Introduction to Geographical Information Science 4 GLHLTH 306 Evolution of health and disease 4 ENVIR 306 Water Pollution 4 BIOL 308 Evolution of Infectious Diseases 4 BIOL 310 Developmental Biology: Development, Stem Cells, and Regeneration 4 BIOL 314 Computational Biology and Bioinformatics 4 PUBPOL 317 Plastic Planet: Pollution and Solutions 4 ENVIR 404/ ECON 404 Environmental Justice: The Economics of Race, Place and Pollution 4 BIOL 409/ GLHLTH 409 Fundamental Immunology 4 BIOL 410 / GLHLTH 410 Principles of Nutrition and Disease 4 BIOL 411/ GLHLTH 411 Vaccine Development for Emerging Infectious Diseases 4 INTGSCI 205 Integrated Science – Research Methods and Science Communication 4",
      "metadata": {
        "file_name": "environmental_science_with_tracks_in_biogeochemistry,_biology,_chemistry,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Environmental Science / Biology"
      }
    }
  ],
  "Environmental Science / Chemistry": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit ENVIR 101 Introduction to Environmental Sciences 4 ENVIR 102 Dynamic Earth and Oceans: Physical and Biological Sciences for the Environment 4 ENVIR 201 Applied Environmental Science and Policy 4 choose one from the following two courses ENVIR 304 Environmental Chemistry and Toxicology 4 ENVIR 202 Biodiversity and Conservation 4 choose one from the following two courses ENVIR 302/ ECON 302 Environmental Economics & Policy 4 ENVIR 301 International Environmental Policy 4 Disciplinary Courses Course Code Course Name Course Credit PHYS 122 General Physics II 4 CHEM 150 General Chemistry II 4 MATH 201 Multivariable Calculus 4 CHEM 201 Organic Chemistry I 4 CHEM 202 Organic Chemistry II 4 CHEM 301 Elements of Physical Chemistry 4 CHEM 401 Analytical Chemistry 4 CHEM 402 Inorganic Chemistry 4 Electives Courses listed in the table below are recommended electives for the major. The course list reflects the most recent intellectual organization of major electives. Depending on the academic year in which you matriculated, some of the courses below may be requirements for your major. To verify required courses, always consult the requirements for the relevant class year in the bulletin of the year in which you matriculated unless you have been approved to complete the major requirements of a subsequent year. (See Ability to Meet Major Requirements Published in Years Subsequent to Year of Matriculation.) Course Code Course Name Course Credit Chemical Transformation ENVIR 306 Water Pollution 4 ENVIR 311 / BIOL 311 Biogeochemistry 4 ENVIR 402 Chemical Transformation of Environmental Contaminants 4 ENVIR 315 / CHEM 315 Aqueous Geochemistry 4 Societal Implications ENVIR 203 The Theory and Practice of Sustainability 4 SOSC 204 Business Ethics 4 ENVIR 303 Climate Change and Society in China 4 PUBPOL 317 Plastic Planet: Pollution and Solutions 4 ENVIR 313 / BIOL 313 Ecosystem Service 4 ENVIR 404 / ECON 404 Environmental Justice: The Economics of Race, Place and Pollution 4 Physical Implications CHEM 403 Advanced Topics in Physical Chemistry 4 Methods INTGSCI 205 Integrated Science – Research Methods and Science Communication 4",
      "metadata": {
        "file_name": "environmental_science_with_tracks_in_biogeochemistry,_biology,_chemistry,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Environmental Science / Chemistry"
      }
    }
  ],
  "Environmental Science / Public Policy": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses SOSC 101 Foundational Questions in Social Science 4 SOSC 102 Introduction to Research Methods 4 BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 Interdisciplinary Courses Course Code Course Name Course Credit ENVIR 101 Introduction to Environmental Sciences 4 ENVIR 102 Dynamic Earth and Oceans: Physical and Biological Sciences for the Environment 4 ENVIR 201 Applied Environmental Science and Policy 4 choose one from the following two courses ENVIR 304 Environmental Chemistry and Toxicology 4 ENVIR 202 Biodiversity and Conservation 4 choose one from the following two courses ENVIR 302/ ECON 302 Environmental Economics & Policy 4 ENVIR 301 International Environmental Policy 4 Disciplinary Courses Course Code Course Name Course Credit STATS 101 Introduction to Applied Statistical Methods 4 PUBPOL 101 Introduction to Policy Analysis 4 PUBPOL 301 Political Analysis for Public Policy 4 PUBPOL 303 Policy Choice as Value Conflict 4 And choose one course from the following two courses ECON 201 Intermediate Microeconomics I 4 PUBPOL 205 Microeconomic Policy Tools 4 Electives Course Code Course Name Course Credit Energy and Climate ENVIR 206 Energy and the Environment 4 PUBPOL 201 Climate Change Law and Policy 4 ENVIR 303 Climate Change and Society in China 4 ENVIR 403 Energy Economics and Policy 4 Policy, Politics, and Society GCULS 108 Science, Culture, and Politics 4 HIST 123 All Around Us – Technology, Infrastructure, and History 2 SOCIOL 180 Society, the Self, and the Changing Natural World 4 PUBPOL 209 The Politics of Environmental Crises 4 PUBPOL 220 Introduction to Regulatory Governance 4 PUBPOL 318 How to Change the World: The Role of Non-State Actors 4 HIST 316/ PUBPOL 316 The Modern Regulatory State 4 ENVIR 404 / ECON 404 Environmental Justice: The Economics of Race, Place and Pollution 4 Global Policy PUBPOL 202 Global Disasters: Science and Policy 4 ENVIR 204 Global Environmental Issues and Policies 2 CULANTH 213 Globalization, Sustainability, and Technology 4 ENVIR 305 Environment and Development Economics in Developing Countries 4 POLSCI 317/ SOSC 317 Politics of Organization 4 Marine Conservation ENVIR 306 Water Pollution 4 PUBPOL 308 Managing the Oceans to Solve Global Problems 4 PUBPOL 317 Plastic Planet: Pollution and Solutions 4 Methods and Skills ENVIR 203 The Theory and Practice of Sustainability 4 WOC 206 Debating Scenarios for Sustainable Futures 4 INFOSCI 302 Introduction to Geographical Information Science 4 CULANTH 210 [84] Ethnographic Field Methods 4 SOSC 320 [85] Panel Data: Advanced Econometric Methods 4 [83] This course was named and numbered CULMOVE 101 Cultures of Globalization prior to Fall 2025. [84] This course was numbered CULANTH 302 Ethnographic Field Methods prior to Fall 2025. [85] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "environmental_science_with_tracks_in_biogeochemistry,_biology,_chemistry,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Environmental Science / Public Policy"
      }
    }
  ],
  "Global Health / Biology": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit GLHLTH 101 Introduction to Global Health 4 GLHLTH 201 Global Health Ethics 4 GLHLTH 205 Social Determinants of Health 4 And choose one from the following three courses GLHLTH 310 Global Disease Control Programs and Policies 4 GLHLTH 303 Global Comparative Health Care Systems 4 GLHLTH 304 Global Health Governance and Policy 4 GLHLTH 280 Ecosystem Health and Human Well-Being 4 GLHLTH 305 Biological Basis of Disease 4 GLHLTH 306 Evolution of Health and Disease 4 GLHLTH 307 Global Mental Health 4 Disciplinary Courses Course Code Course Name Course Credit CHEM 201 Organic Chemistry I 4 BIOL 201 Cell and Molecular Biology 4 BIOL 202 Genetics and Evolution 4 BIOL 208 General Ecology 4 BIOL 212 Microbiology 4 BIOL 305 Biochemistry 4</td And choose one from the following four courses STATS 101 Introduction to Applied Statistical Methods 4</td MATH 206 Probability and Statistics 4</td Electives Course Code Course Name Course Credit Students are encouraged to take GLHLTH 301 Global Health Research Methods Epidemiology/Biostatistics GLHLTH 301 Global Health Research Methods 4 GLHLTH 311 Introduction to Epidemiology 4 SOSC 320 [91] Panel Data: Advanced Econometric Methods 4 INFOSCI 302 Introduction to Geographical Information Science 4 BIOL 203 Molecular, Behavioral and Social Evolution: Evolution of Genomes, Traits, Behaviors and Societies 4 BIOL 308 Evolution of Infectious Diseases 4 HIST 212 Pandemics in World History from the Black Death to COVID-19 4 Advanced Biology for Graduate School and Methods INTGSCI 205 Integrated Science – Research Methods and Science Communication 4 GLHLTH 301 Global Health Research Methods 4 BIOL 306 Cell Signaling and Diseases 4 BIOL 307 Cancer Genetics 4 BIOL 308 Evolution of Infectious Diseases 4 BIOL 310 Developmental Biology: Development, Stem Cells, and Regeneration 4 BIOL 321 Advanced Topics in Cellular and Molecular Biology 4 BIOL 409/ GLHLTH 409 Fundamental Immunology 4 BIOL 410  / GLHLTH 410 Principles of Nutrition and Disease 4 BIOL 411/ GLHLTH 411 Vaccine Development for Emerging Infectious Diseases 4 Health Promotion/ Policy GLHLTH 202 Media and Health Communication 4 GLHLTH 301 Global Health Research Methods 4 GLHLTH 312 Global Aging and Care 4 SOSC 302 [92] Research Designs for Causal Inference 4 PUBPOL 220 Introduction to Regulatory Governance 4 PUBPOL 318 How to Change the World: The Role of Non-State Actors 4 Health Humanities GLHLTH 301 Global Health Research Methods 4 CULANTH 303 Politics of Food: Land, Labor, Health, and Economics 4 ECON 301 Health Economics 4 GCULS 301 Religion and Sexuality 4 HUM 302 [93] Gender in Global Perspective 4 ETHLDR 206 Global Justice and Health Care 4 BIOL 320 Bioethics 4 CULANTH 405 [94] Bodies, Medicine, Healing 4 Environment and Health ENVIR 101 Introduction to Environmental Sciences 4 GLHLTH 280 Ecosystem Health and Human Well-Being 4 ETHLDR 204 Environmental Ethics 4 ENVIR 204 Global Environmental Issues and Policies 2 ENVIR 304 Environmental Chemistry and Toxicology 4 ENVIR 402 Chemical Transformation of Environmental Contaminants 4 ENVIR 306 Water Pollution 4 PUBPOL 317 Plastic Planet: Pollution and Solutions 4 [91] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. [92] This course was named POLSCI 301 Program Evaluation prior to Fall 2025. [93] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. [94] This course was named CULANTH 405 Medical Anthropology prior to fall 2025.",
      "metadata": {
        "file_name": "global_health_with_tracks_in_biology_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Global Health / Biology"
      }
    }
  ],
  "Global Health / Public Policy": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 101 Foundational Questions in Social Science 4 SOSC 102 Introduction to Research Methods 4 BIOL 110 Integrated Science – Biology 4 And choose one of the following two math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 Interdisciplinary Courses Course Code Course Name Course Credit GLHLTH 101 Introduction to Global Health 4 GLHLTH 201 Global Health Ethics 4 GLHLTH 205 Social Determinants of Health 4 And choose one from the following three courses GLHLTH 310 Global Disease Control Programs and Policies 4 GLHLTH 303 Global Comparative Health Care Systems 4 GLHLTH 304 Global Health Governance and Policy 4 And choose one from the following four courses GLHLTH 280 Ecosystem Health and Human Well-Being 4 GLHLTH 305 Biological Basis of Disease 4 GLHLTH 306 Evolution of Health and Disease 4 GLHLTH 307 Global Mental Health 4 Disciplinary Courses Course Code Course Name Course Credit STATS 101 Introduction to Applied Statistical Methods 4 PUBPOL 101 Introduction to Policy Analysis 4 PUBPOL 301 Political Analysis for Public Policy 4 PUBPOL 303 Policy Choice as Value Conflict 4 Choose one course from the following two courses ECON 201 Intermediate Microeconomics I 4 PUBPOL 205 Microeconomic Policy Tools 4 Electives Course Code Course Name Course Credit Students are encouraged to take GLHLTH 301 Global Health Research Methods Epidemiology/Biostatistics GLHLTH 301 Global Health Research Methods 4 GLHLTH 311 Introduction to Epidemiology 4 GLHLTH 312 Global Aging and Care 4 SOSC 320 [95] Panel Data: Advanced Econometric Methods 4 INFOSCI 302 Introduction to Geographical Information Science 4 BIOL 203 Molecular, Behavioral and Social Evolution: Evolution of Genomes, Traits, Behaviors and Societies 4 BIOL 308 Evolution of Infectious Diseases 4 HIST 212 Pandemics in World History from the Black Death to COVID-19 4 Advanced Biology for Methods Training and Graduate School INTGSCI 205 Integrated Science – Research Methods and Science Communication 4 GLHLTH 301 Global Health Research Methods 4 BIOL 306 Cell Signaling and Diseases 4 BIOL 307 Cancer Genetics 4 BIOL 308 Evolution of Infectious Diseases 4 BIOL 310 Developmental Biology: Development, Stem Cells, and Regeneration 4 BIOL 410 / GLHLTH 410 Principles of Nutrition and Disease 4 BIOL 411/ GLHLTH 411 Vaccine Development for Emerging Infectious Diseases 4 Health Promotion/ Policy GLHLTH 301 Global Health Research Methods 4 GLHLTH 202 Media and Health Communication 4 SOSC 302 [96] Research Designs for Causal Inference 4 PUBPOL 220 Introduction to Regulatory Governance 4 PUBPOL 318 How to Change the World: The Role of Non-State Actors 4 Health Humanities GLHLTH 301 Global Health Research Methods 4 CULANTH 303 Politics of Food: Land, Labor, Health, and Economics 4 ECON 301 Health Economics 4 GCULS 301 Religion and Sexuality 4 HUM 302 [97] Gender in Global Perspective 4 ETHLDR 206 Global Justice and Health Care 4 BIOL 320 Bioethics 4 CULANTH 405 [98] Bodies, Medicine, Healing 4 Environment and Health ENVIR 101 Introduction to Environmental Sciences 4 GLHLTH 280 Ecosystem Health and Human Well-Being 4 ETHLDR 204 Environmental Ethics 4 ENVIR 204 Global Environmental Issues and Policies 2 ENVIR 304 Environmental Chemistry and Toxicology 4 ENVIR 402 Chemical Transformation of Environmental Contaminants 4 ENVIR 306 Water Pollution 4 PUBPOL 317 Plastic Planet: Pollution and Solutions 4 [95] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. [96] This course was named POLSCI 301 Program Evaluation prior to Fall 2025. [97] This course was named GCULS 302 Gender in Global Perspective prior to Fall 2025. [98] This course was named CULANTH 405 Medical Anthropology prior to fall 2025. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "global_health_with_tracks_in_biology_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Global Health / Public Policy"
      }
    }
  ],
  "Materials Science / Chemistry": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit CHEM 201 Organic Chemistry I 4 MATSCI 201 Fundamentals of Materials Science 4 MATSCI 301 Materials Synthesis and Characterization (Lab) 4 MATSCI 302 Electronic, Optical and Magnetic Properties of Materials 4 MATSCI 401 Mechanical Properties of Materials 4 Disciplinary Courses Course Code Course Name Course Credit PHYS 122 General Physics II 4 CHEM 150 General Chemistry II 4 MATH 201 Multivariable Calculus 4 CHEM 202 Organic Chemistry II 4 CHEM 301 Elements of Physical Chemistry 4 CHEM 401 Analytical Chemistry 4 CHEM 402 Inorganic Chemistry 4 Electives Course Code Course Name Course Credit Introduction to Materials Science MATSCI 101 Introduction to Materials Science 4 Methods INTGSCI 205 Integrated Science – Research Methods and Science Communication 4 Chemistry in General CHEM 403 Advanced Topics in Physical Chemistry 4 Environmental Chemistry ENVIR 304 Environmental Chemistry and Toxicology 4 CHEM 315/ ENVIR 315 Aqueous Geochemistry 4 ENVIR 402 Chemical Transformation of Environmental Contaminants 4 Materials Chemistry (Nanoscience, Polymers and Others) MATSCI 303 Phase Transformations 4 MATSCI 402 Introduction to Nanoscale Functional Materials 4 PHYS 402 Solid State and Soft Matter Physics 4 PHYS 310 Physics of Particulate Materials 4 MATSCI 403 Quantum Physics for Materials Science 4 MATSCI 404 Polymers and Biomaterials 4 PHYS 408 Quantum Information Science 4 CHEM 410 Advanced Materials Chemistry Laboratory (Lab) 4",
      "metadata": {
        "file_name": "materials_science_with_tracks_in_chemistry_and_physics_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Materials Science / Chemistry"
      }
    }
  ],
  "Materials Science / Physics": [
    {
      "text": "Divisional Foundation Course Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit CHEM 201 Organic Chemistry I 4 MATSCI 201 Fundamentals of Materials Science 4 MATSCI 301 Materials Synthesis and Characterization (Lab) 4 MATSCI 302 Electronic, Optical and Magnetic Properties of Materials 4 MATSCI 401 Mechanical Properties of Materials 4 Disciplinary Courses Course Code Course Name Course Credit PHYS 122 General Physics II 4 MATH 201 Multivariable Calculus 4 PHYS 201 Optics and Modern Physics 4 MATH 202 Linear Algebra 4 PHYS 302 Thermal and Statistical Physics 4 PHYS 405 Advanced Physics Laboratory and Seminar 4 And choose two from the following courses PHYS 301 Classical Mechanics 4 PHYS 304 Electricity and Magnetism 4 PHYS 306 Quantum Mechanics 4 Electives Course Code Course Name Course Credit Introduction to Materials Science MATSCI 101 Introduction to Materials Science 4 Methods INTGSCI 205 Integrated Science – Research Methods and Science Communication 4 Physics in General PHYS 101 Frontiers of 21 st Century Physics 4 PHYS 105 /ARTS 105 [119] The Science of Traditional Asian Music 4 PHYS 134 Introductory Astronomy 4 PHYS 403 Introduction to Nuclear and Particle Physics 4 Theoretical and Computational COMPSCI 201 Introduction to Programming and Data Structures 4 MATSCI 202 Mathematical Methods for Materials Science 4 MATH 206 Probability and Statistics 4 MATH 303 ODE and Dynamical Systems 4 PHYS 404 Nonlinear Dynamics 4 PHYS 408 Quantum Information Science 4 Condensed Matter MATSCI 303 Phase Transformations 4 PHYS 310 Physics of Particulate Materials 4 MATSCI 402 Introduction to Nanoscale Functional Materials 4 PHYS 402 Solid State and Soft Matter Physics 4 MATSCI 403 Quantum Physics for Materials Science 4 MATSCI 404 Polymers and Biomaterials 4 [119] This course was named PHYS 105 The Science of Asian Sound prior to fall term 2023. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "materials_science_with_tracks_in_chemistry_and_physics_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Materials Science / Physics"
      }
    }
  ],
  "Molecular Bioscience / Biogeochemistry": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit CHEM 201 Organic Chemistry I 4 PHYS 303 Introduction to Biophysics 4 BIOL 305 Biochemistry 4 BIOL 320 Bioethics 4 Choose one of the two courses below BIOL 201 Cell and Molecular Biology 4 BIOL 202 Genetics and Evolution 4 Disciplinary Courses Course Code Course Name Course Credit ENVIR 102 Dynamic Earth and Oceans: Physical and Biological Sciences for the Environment 4 BIOL 208 General Ecology 4 BIOL 311/ ENVIR 311 Biogeochemistry 4 And choose one course from the following three courses STATS 101 Introduction to Applied Statistical Methods 4 MATH 206 Probability and Statistics 4 And choose one course from the following three courses BIOL 212 Microbiology 4 BIOL 313/ ENVIR 313 Ecosystem Service 4 BIOL 319 Global Change Biology 4 And choose one course from the following three courses CHEM 150 General Chemistry II 4 BIOL 312 Ecophysiology 4 ENVIR 315/ CHEM 315 Aqueous Geochemistry 4 Electives Course Code Course Name Course Credit General Biology BIOL 318 Food Web Ecology 4 BIOL 405 Microbial Ecology 4 Environmental and Chemistry ENVIR 201 Dynamic Earth and Oceans: Physical and Biological Sciences for the Environment 4 ENVIR 202 Biodiversity and Conservation 4 ENVIR 304 Environmental Chemistry and Toxicology 4",
      "metadata": {
        "file_name": "molecular_bioscience_with_tracks_in_biogeochemistry,_biophysics,_cell_and_molecular_biology,_genetics_and_genomics,_and_neuroscience_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Molecular Bioscience / Biogeochemistry"
      }
    }
  ],
  "Molecular Bioscience / Biophysics": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit CHEM 201 Organic Chemistry I 4 PHYS 303 Introduction to Biophysics 4 BIOL 305 Biochemistry 4 BIOL 320 Bioethics 4 Choose one of the two courses below BIOL 201 Cell and Molecular Biology 4 BIOL 202 Genetics and Evolution 4 Disciplinary Courses Course Code Course Name Course Credit PHYS 122 General Physics II 4 MATH 201 Multivariable Calculus 4 PHYS 201 Optics and Modern Physics 4 MATH 202 Linear Algebra 4 PHYS 302 Thermal and Statistical Physics 4 PHYS 406 Biophysics 4 And choose two courses from the following four courses PHYS 301 Classical Mechanics 4 PHYS 304 Electricity and Magnetism 4 PHYS 306 Quantum Mechanics 4 PHYS 404 Nonlinear Dynamics 4 Electives Course Code Course Name Course Credit Methods INTGSCI 205 Scientific Methods and Communications 4 Biomedical Sciences BIOL 316 Quantitative Physiology 4 NEUROSCI 202 Medical Neuroscience 4 NEUROSCI 212 Cognitive Neuroscience 4 Mathematical, and Computer Sciences MATH 303 ODE and Dynamical Systems 4 PHYS 310 Physics of Particulate Materials 4 MATH 403 Partial Differential Equations 4 MATH  410 Modeling Biological Systems 4 Chemistry CHEM 404 Physical Biochemistry 4",
      "metadata": {
        "file_name": "molecular_bioscience_with_tracks_in_biogeochemistry,_biophysics,_cell_and_molecular_biology,_genetics_and_genomics,_and_neuroscience_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Molecular Bioscience / Biophysics"
      }
    }
  ],
  "Molecular Bioscience / Cell and Molecular Biology": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit CHEM 201 Organic Chemistry I 4 BIOL 202 Genetics and Evolution 4 PHYS 303 Introduction to Biophysics 4 BIOL 305 Biochemistry 4 BIOL 320 Bioethics 4 Disciplinary Courses Course Code Course Name Course Credit BIOL 201 Cell and Molecular Biology 4 BIOL 212 Microbiology 4 And choose three from the following four courses BIOL 304 Molecular Genetic Analysis 4 BIOL 306 Cell Signaling and Diseases 4 BIOL 315 Experimental Molecular Biology 4 BIOL 321 Advanced Topics in Cellular and Molecular Biology 4 And choose one from the following courses STATS 101 Introduction to Applied Statistical Methods 4 MATH 206 Probability and Statistics 4 Electives Course Code Course Name Course Credit Methods INTGSCI 205 Scientific Methods and Communications 4 Biological Science BIOL 203 Molecular, Behavioral and Social Evolution: Evolution of Genomes, Traits, Behaviors and Societies 4 BIOL 307 Cancer Genetics 4 BIOL 310 Developmental Biology: Development, Stem Cells, and Regeneration 4 BIOL 314 Computational Biology and Bioinformatics 4 BIOL 317 Systems Biology 4 BIOL 401 Advanced Biochemistry: Cell Metabolism 4 BIOL 409/ GLHLTH 409 Fundamental Immunology 4 BIOL 410 / GLHLTH 410 Principles of Nutrition and Disease 4 Data Science BIOL 314 Computational Biology and Bioinformatics 4 Chemistry CHEM 404 Physical Biochemistry 4 Neuroscience NEUROSCI 102 Computational Biology and Bioinformatics 4 NEUROSCI 202 Medical Neuroscience 4",
      "metadata": {
        "file_name": "molecular_bioscience_with_tracks_in_biogeochemistry,_biophysics,_cell_and_molecular_biology,_genetics_and_genomics,_and_neuroscience_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Molecular Bioscience / Cell and Molecular Biology"
      }
    }
  ],
  "Molecular Bioscience / Genetics and Genomics": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit CHEM 201 Organic Chemistry I 4 BIOL 202 Genetics and Evolution 4 PHYS 303 Introduction to Biophysics 4 BIOL 305 Biochemistry 4 BIOL 320 Bioethics 4 Disciplinary Courses Course Code Course Name Course Credit BIOL 201 Cell and Molecular Biology 4 And choose four from the following five courses BIOL 304 Molecular Genetic Analysis 4 BIOL 314 Computational Biology and Bioinformatics 4 BIOL 321 Advanced Topics in Cellular and Molecular Biology 4 BIOL 403 Experimental Methods in Functional Genomics 4 BIOL 407 Population Genomics and Molecular Evolution 4 And choose one from the following courses STATS 101 Introduction to Applied Statistical Methods 4 MATH 206 Probability and Statistics 4 Electives Course Code Course Name Course Credit Methods INTGSCI 205 Scientific Methods and Communications 4 Biomedical Sciences BIOL 203 Molecular, Behavioral and Social Evolution: Evolution of Genomes, Traits, Behaviors and Societies 4 BIOL 212 Microbiology 4 NEUROSCI 301 Research Methods in Neuroscience 4 BIOL 310 Developmental Biology: Development, Stem Cells, and Regeneration 4 BIOL 315 Experimental Molecular Biology 4 BIOL 317 Systems Biology 4 BIOL 404 Genomics of Adaptation 4 BIOL 409/ GLHLTH 409 Fundamental Immunology 4 Data Science BIOL 314 Computational Biology and Bioinformatics 4 Environmental Science ENVIR 202 Biodiversity and Conservation 4",
      "metadata": {
        "file_name": "molecular_bioscience_with_tracks_in_biogeochemistry,_biophysics,_cell_and_molecular_biology,_genetics_and_genomics,_and_neuroscience_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Molecular Bioscience / Genetics and Genomics"
      }
    }
  ],
  "Molecular Bioscience / Neuroscience": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And complete the following courses BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 Interdisciplinary Courses Course Code Course Name Course Credit CHEM 201 Organic Chemistry I 4 BIOL 202 Genetics and Evolution 4 PHYS 303 Introduction to Biophysics 4 BIOL 305 Biochemistry 4 BIOL 320 Bioethics 4 Disciplinary Courses Course Code Course Name Course Credit NEUROSCI 102 Biological Basis of Behavior 4 BEHAVSCI 205 Systems and Circuits 4 NEUROSCI 212 Cognitive Neuroscience 4 NEUROSCI 301 Research Methods in Neuroscience 4 BEHAVSCI 301 Computational Neuroscience 4 Electives Course Code Course Name Course Credit Methods INTGSCI 205 Scientific Methods and Communications 4 Biomedical Sciences BIOL 203 Molecular, Behavioral and Social Evolution: Evolution of Genomes, Traits, Behaviors and Societies 4 BIOL 307 Cancer Genetics 4 BIOL 310 Developmental Biology: Development, Stem Cells, and Regeneration 4 BIOL 314 Computational Biology and Bioinformatics 4 BIOL 317 Systems Biology 4 BIOL 401 Advanced Biochemistry: Cell Metabolism 4 BIOL 409/ GLHLTH 409 Fundamental Immunology 4 BIOL 410/ GLHLTH 410 Principles of Nutrition and Disease 4 BIOL 411/ GLHLTH 411 Vaccine Development for Emerging Infectious Diseases 4 Data Science BIOL 314 Computational Biology and Bioinformatics 4 Chemistry CHEM 404 Physical Biochemistry 4 Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "molecular_bioscience_with_tracks_in_biogeochemistry,_biophysics,_cell_and_molecular_biology,_genetics_and_genomics,_and_neuroscience_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Molecular Bioscience / Neuroscience"
      }
    }
  ],
  "Philosophy, Politics, and Economics / Economic History": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 101 Foundational Questions in Social Science 4 SOSC 102 Introduction to Research Methods 4 STATS 101 Introduction to Applied Statistics 4 Interdisciplinary Courses Course Code Course Name Course Credit PPE 101 Introduction to Philosophy, Politics, and Economics 4 ECON 101 Economics Principles 4 ECON 201 Intermediate Microeconomics I 4 PPE 202 [120] Ethics, Markets, and Politics 4 PPE 303 [121] Conceptions of Democracy and Meritocracy 4 PUBPOL 303 Policy Choice as Value Conflict 4 PPE 490 Senior Seminar in Philosophy, Politics, and Economics 4 Disciplinary Courses Course Code Course Name Course Credit HIST 227 The Global Economy in History 4 ECON 204 Intermediate Macroeconomics 4 ECON 212 Comparative Economic History 4 And choose one of the following courses HIST 201 Methods of Historical Research 4 SOSC 205 [122] Linear Regression: Introduction to Econometrics 4 And choose one of the following courses GCHINA 301/POLECON 302 China’s Economic Transition 4 POLECON 301 International Development 4 ECON 307 History of Monetary and International Crises 4 [120] This course was named ETHLDR 202 Ethics, Markets, and Politics prior to Fall 2025. [121] This course was named ETHLDR 203 Conceptions of Democracy and Meritocracy prior to Fall 2025. [122] This course was named ECON 203 Introduction to Econometrics prior to Fall 2025. Students are encouraged to complete SOSC 205 before submitting a Signature Work Project Proposal. Electives Course Code Course Name Course Credit ECON 225/HIST 225 History of Economic Thought 4 ECON 301 Health Economics 4 ECON 302/ ENVIR 302 Environmental Economics 4 ECON 303 Financial Institutions 4 ECON 304 Economic Growth 4 ECON 310 Urban Economics 4 ECON 314 International Trade 4 HIST 228 Power, Technology, and the Environment in World History 4 HIST 229 Labor, Migration and the Making of the Modern World 4 HIST 309 Global Commodities and Their Discontents 4 POLECON 201 International Political Economy 4 STATS 201 Introduction to Machine Learning for Social Science 4",
      "metadata": {
        "file_name": "philosophy,_politics,_and_economics,_with_tracks_in_economic_history,_philosophy,_political_science,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Philosophy, Politics, and Economics / Economic History"
      }
    }
  ],
  "Philosophy, Politics, and Economics / Philosophy": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 101 Foundational Questions in Social Science 4 SOSC 102 Introduction to Research Methods 4 STATS 101 Introduction to Applied Statistics 4 Interdisciplinary Courses Course Code Course Name Course Credit PPE 101 Introduction to Philosophy, Politics, and Economics 4 ECON 101 Economics Principles 4 ECON 201 Intermediate Microeconomics I 4 PPE 202 [123] Ethics, Markets, and Politics 4 PPE 303 [124] Conceptions of Democracy and Meritocracy 4 PUBPOL 303 Policy Choice as Value Conflict 4 PPE 490 Senior Seminar in Philosophy, Politics, and Economics 4 Disciplinary Courses Course Code Course Name Course Credit PHIL 226/HIST 226 [125] History of Chinese Philosophy 4 PHIL 210 [126] History of Western Philosophy 4 PHIL 207 [127] Ethical Theory in Philosophical Traditions 4 PHIL 398 Special Topics in Philosophy 4 And choose one of the following courses PHIL 205 Logic 4 PHIL 305 Cross-Cultural Philosophy 4 PHIL 309 Philosophy of the Social Sciences 4 [123] This course was named ETHLDR 202 Ethics, Markets, and Politics prior to Fall 2025. [124] This course was named ETHLDR 203 Conceptions of Democracy and Meritocracy prior to Fall 2025. [125] This course was named PHI 102/HIST 101 Ancient Chinese History and Philosophy prior to Fall 2025. [126] This course was named PHIL 101 Introduction to Western Philosophy prior to Fall 2025. [127] This course was named PHIL 207 Ethical Theory prior to Fall 2025. Electives Course Code Course Name Course Credit BIOL 320 Bioethics 4 ECON 225/HIST 225 History of Economic Thought 4 ETHLDR 204 Environmental Ethics 4 HUM 201 Research in Philosophy and Religion 4 GLHLTH 201 Global Health Ethics 4 LIT 315 Translation Theory 4 PHIL 112 Thinking and Doing 4 PHIL 115 Confucianism and Feminism 4 PHIL 303 Topics in Feminist Philosophy 4 POLSCI 223 Power and Justice in the History of Political Thought 4 POLSCI 398-1 Special Topics in Political Theory 4 SOCIOL 305 Theory and Society 4",
      "metadata": {
        "file_name": "philosophy,_politics,_and_economics,_with_tracks_in_economic_history,_philosophy,_political_science,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Philosophy, Politics, and Economics / Philosophy"
      }
    }
  ],
  "Philosophy, Politics, and Economics / Political Science": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 101 Foundational Questions in Social Science 4 SOSC 102 Introduction to Research Methods 4 STATS 101 Introduction to Applied Statistics 4 Interdisciplinary Courses Course Code Course Name Course Credit PPE 101 Introduction to Philosophy, Politics, and Economics 4 ECON 101 Economics Principles 4 ECON 201 Intermediate Microeconomics I 4 PPE 202 [128] Ethics, Markets, and Politics 4 PPE 303 [129] Conceptions of Democracy and Meritocracy 4 PUBPOL 303 Policy Choice as Value Conflict 4 PPE 490 Senior Seminar in Philosophy, Politics, and Economics 4 Disciplinary Courses Course Code Course Name Course Credit POLSCI 101 International Politics 4 POLSCI 104 Comparative Politics and Institutions 4 POLSCI 223 Power and Justice in the History of Political Thought 4 CULSOC 201 Social Inequalities 4 And choose one of the following courses POLSCI 303 International Politics of East Asia 4 POLSCI 307 Political Economy of Institutions 4 POLSCI 308 Global Governance 4 POLSCI 398-1 Special Topics Political Theory 4 [128] This course was named ETHLDR 202 Ethics, Markets, and Politics prior to Fall 2025. [129] This course was named ETHLDR 203 Conceptions of Democracy and Meritocracy prior to Fall 2025. Electives Course Code Course Name Course Credit CULANTH 210 [130] Ethnographic Field Methods 4 ECON 225/HIST 225 History of Economic Thought 4 GCHINA 202 Modern Chinese Politics 4 GCHINA 304 [131] US/China Relations 4 PHIL 309 Philosophy of the Social Sciences 4 POLECON 201 International Political Economy 4 POLECON 301 International Development 4 POLECON 302/GCHINA 301 China’s Economic Transition 4 PUBPOL 213 Authoritarian Regimes 4 PUBPOL 301 Political Analysis for Public Policy 4 SOSC 206 Qualitative Research Methods 4 SOCIOL 305 Theory and Society 4 SOSC 302 [132] Research Designs for Causal Inference 4 SOSC 314 Computational Social Science 4 SOCIOL 320 [133] Panel Data: Advanced Econometric Methods 4 [130] This course was numbered CULANTH 302 Ethnographic Field Methods prior to Fall 2025. [131] This course was named POLSCI 221 US/China Relations prior to Fall 2025. [132] This course was named POLSCI 301 Program Evaluation prior to Fall 2025. [133] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025.",
      "metadata": {
        "file_name": "philosophy,_politics,_and_economics,_with_tracks_in_economic_history,_philosophy,_political_science,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Philosophy, Politics, and Economics / Political Science"
      }
    }
  ],
  "Philosophy, Politics, and Economics / Public Policy": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 101 Foundational Questions in Social Science 4 SOSC 102 Introduction to Research Methods 4 STATS 101 Introduction to Applied Statistics 4 Interdisciplinary Courses Course Code Course Name Course Credit PPE 101 Introduction to Philosophy, Politics, and Economics 4 ECON 101 Economics Principles 4 ECON 201 Intermediate Microeconomics I 4 PPE 202 [134] Ethics, Markets, and Politics 4 PPE 303 [135] Conceptions of Democracy and Meritocracy 4 PUBPOL 303 Policy Choice as Value Conflict 4 PPE 490 Senior Seminar in Philosophy, Politics, and Economics 4 Disciplinary Courses Course Code Course Name Course Credit POLSCI 101 International Politics 4 POLSCI 104 Comparative Politics and Institutions 4 PUBPOL 301 Political Analysis for Public Policy 4 PUBPOL 223/SOCIOL 223 [136] Comparative Educational Systems 4 [134] This course was named ETHLDR 202 Ethics, Markets, and Politics prior to Fall 2025. [135] This course was named ETHLDR 203 Conceptions of Democracy and Meritocracy prior to Fall 2025. [136] This course was named PUBPOL/SOCIOL/SOSC 309 Education, Policy, and Society prior to Fall 2025. Electives Course Code Course Name Course Credit CULANTH 210 [137] Ethnographic Field Methods 4 CULANTH 211 [138] Race, Gender, and Labor in the City 4 CULANTH 213 [139] Globalization, Sustainability, and Technology 4 CULSOC 201 Social Inequalities 4 ENVIR 301 International Environmental Policy 4 GCHINA 202 Modern Chinese Politics 4 GLHLTH 303 Global Comparative Healthcare Systems 4 POLSCI 302 Public Opinion 4 POLSCI 307 Political Economy of Institutions 4 PUBPOL 213 Authoritarian Regimes 4 SOSC 315 Urban Sociology 4 SOSC 206 Qualitative Research Methods 4 [137] This course was numbered CULANTH 302 Ethnographic Field Methods prior to Fall 2025. [138] This course was named CULANTH 211 Gender, Mobility, and Labor prior to Fall 2025. [139] This course was named and numbered CULMOVE 101 Cultures of Globalization prior to Fall 2025. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "philosophy,_politics,_and_economics,_with_tracks_in_economic_history,_philosophy,_political_science,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Philosophy, Politics, and Economics / Public Policy"
      }
    }
  ],
  "Quantitative Political Economy / Economics": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 102 Introduction to Research Methods 4 STATS 101 Introduction to Applied Statistical Methods 4 And choose one from the following two courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 Interdisciplinary Courses Course Code Course Name Course Credit ECON 101 Economics Principles 4 PPE 202 [140] Ethics, Markets, Politics 4 POLECON 201 International Political Economy 4 SOSC 205 [141] Linear Regression: Introduction to Econometrics 4 And choose one of the following three courses. **Students are encouraged to complete one of these courses before submitting a Signature Work Proposal.** SOSC 302 [142] Research Designs for Causal Inference 4 SOSC 314 Computational Social Science 4 SOSC 320 [143] Panel Data: Advanced Econometric Methods 4 And choose one from the following two courses POLECON 301 International Development 4 POLECON 302 / GCHINA 301 China’s Economic Transition 4 And choose one from the following two courses POLECON 490 Senior Seminar: Advanced Topics 4 [140] This course was named ETHLDR 202 prior Fall 2025. [141] This course was named ECON 203 Introduction to Econometrics prior to Fall 2025. Students are encouraged to complete SOSC 205 before submitting a Signature Work Project Proposal. [142] This course was named POLSCI 301 Program Evaluation prior to Fall 2025. [143] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. Disciplinary Courses Course Code Course Name Course Credit ECON 201 Intermediate Microeconomics I 4 ECON 202 Intermediate Microeconomics II 4 ECON 204 Intermediate Macroeconomics 4 And complete one of the following courses ECON 301 Health Economics 4 ECON 302/ENVIR 302 Environmental Economics and Policy 4 ECON 303 Financial Institutions 4 ECON 304 Economic Growth 4 ECON 305 Mathematical Economics 4 ECON 307 History of Monetary and International Crises 4 ECON 310 Urban Economics 4 ECON 314 International Trade 4 ECON 315/PUBPOL 315 Economics of the Public Sector 4 ECON 318 Game Theory 4 ECON 333 Social and Economic Networks 4 Electives Course Code Course Name Course Credit ECON 206/COMPSCI 206 Computational Microeconomics 4 ECON 212 Comparative Economic History 4 ECON 213 Sustainable Investing 4 ECON 225/ HIST 225 History of Economic Thought 4 BEHAVSCI 101 Introduction to Behavioral Science 4 BEHAVSCI 102 Mechanisms of Human Behavior 4 ECON 317/ MATH 317 Quantitative Finance 4 STATS 201 Introduction to Machine Learning for Social Science 4 STATS 102 Introduction to Data Science 4 Mathematics Courses Recommended for Students Planning to Pursue Postgraduate Studies in Economics MATH 201 Multivariate Calculus 4 MATH 202 Linear Algebra 4 MATH 206 Probability and Statistics 4 MATH 308 Real Analysis 4",
      "metadata": {
        "file_name": "quantitative_political_economy_with_tracks_in_economics,_political_science,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Quantitative Political Economy / Economics"
      }
    }
  ],
  "Quantitative Political Economy /Political Science": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 102 Introduction to Research Methods 4 STATS 101 Introduction to Applied Statistical Methods 4 And choose one from the following two courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 Interdisciplinary Courses Course Code Course Name Course Credit ECON 101 Economics Principles 4 PPE 202 [144] Ethics, Markets, Politics 4 POLECON 201 International Political Economy 4 SOSC 205 [145] Linear Regression: Introduction to Econometrics 4 And choose one of the following three courses. **Students are encouraged to complete one of these courses before submitting a Signature Work Proposal.** SOSC 302 [146 Research Designs for Causal Inference 4 SOSC 314 Computational Social Science 4 SOSC 320 [147] Panel Data: Advanced Econometric Methods 4 And choose one from the following two courses POLECON 301 International Development 4 POLECON 302 / GCHINA 301 China’s Economic Transition 4 And choose one from the following two courses POLECON 490 Senior Seminar: Advanced Topics 4 [144] This course was named ETHLDR 202 prior Fall 2025. [145] This course was named ECON 203 Introduction to Econometrics prior to Fall 2025. Students are encouraged to complete SOSC 205 before submitting a Signature Work Project Proposal. [146] This course was named POLSCI 301 Program Evaluation prior to Fall 2025. [147] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. Disciplinary Courses Course Code Course Name Course Credit POLSCI 101 International Politics 4 POLSCI 104 Comparative Politics and Institutions 4 POLSCI 222 [148] Institutions for Social Choice 4 And complete one of the following 4 courses POLSCI 302 Public Opinion 4 PPE 303 [149] Conceptions of Democracy and Meritocracy 4 POLSCI 307 Political Economy of Institutions 4 POLSCI 308 Global Governance 4 [148] This course was named POLSCI 222 Social Choice and Democracy prior to Fall 2025. [149] This course was named ETHLDR 203 Conceptions of Meritocracy and Democracy prior to Fall 2025. Electives Course Code Course Name Course Credit CULSOC 201 Social Inequalities 4 GCHINA 202 Modern Chinese Politics 4 GCHINA 304 [150] US/China Relations 4 POLSCI 223 Power and Justice in the History of Political Thought 4 PUBPOL 213 Authoritarian Regimes 4 PUBPOL 301 Political Analysis for Public Policy 4 [150] This course was named POLSCI 221 US/China Relations prior to Fall 2025.",
      "metadata": {
        "file_name": "quantitative_political_economy_with_tracks_in_economics,_political_science,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Quantitative Political Economy /Political Science"
      }
    }
  ],
  "Quantitative Political Economy /Public Policy": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit SOSC 102 Introduction to Research Methods 4 STATS 101 Introduction to Applied Statistical Methods 4 And choose one from the following two courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 Interdisciplinary Courses Course Code Course Name Course Credit ECON 101 Economics Principles 4 PPE 202 [151] Ethics, Markets, Politics 4 POLECON 201 International Political Economy 4 SOSC 205 [152] Linear Regression: Introduction to Econometrics 4 And choose one of the following three courses. **Students are encouraged to complete one of these courses before submitting a Signature Work Proposal.** SOSC 302 [153] Research Designs for Causal Inference 4 SOSC 314 Computational Social Science 4 SOSC 320 [154] Panel Data: Advanced Econometric Methods 4 And choose one from the following two courses POLECON 301 International Development 4 POLECON 302 / GCHINA 301 China’s Economic Transition 4 And choose one from the following two courses POLECON 490 Senior Seminar: Advanced Topics 4 [151] This course was named ETHLDR 202 prior Fall 2025. [152] This course was named ECON 203 Introduction to Econometrics prior to Fall 2025. Students are encouraged to complete SOSC 205 before submitting a Signature Work Project Proposal. [153] This course was named POLSCI 301 Program Evaluation prior to Fall 2025. [154] This course was names SOSC 320 Data in the World: Applied Social Statistics prior to Fall 2025. Disciplinary Courses Course Code Course Name Course Credit PUBPOL 101 Introduction to Policy Analysis 4 PUBPOL 301 Political Analysis for Public Policy 4 PUBPOL 303 Policy Choice as Value Conflict 4 PUBPOL 315/ ECON 315 Economics of the Public Sector 4 Electives Course Code Course Name Course Credit PUBPOL 213 Authoritarian Regimes 4 PUBPOL 221 Comparative Social Policy 4 CULSOC 201 Social Inequalities 4 GLHLTH 303 Global Comparative Healthcare Systems 4 ENVIR 301 International Environmental Policy 4 PUBPOL 223/ SOCIOL 223 [155] Comparative Educational Systems 4 [155] This course was named PUBPOL/SOCIOL/SOSC 309 Education, Policy, and Society prior to Fall 2025. Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "quantitative_political_economy_with_tracks_in_economics,_political_science,_and_public_policy_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Quantitative Political Economy /Public Policy"
      }
    }
  ],
  "Applied Mathematics and Computational Sciences/Computer Science": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And choose two of the following courses (PHYS 121 and INTGSCI 205 are strongly recommended) BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 INTGSCI 205 Scientific Methods and Communication 4 Interdisciplinary Courses Course Code Course Name Course Credit Choose one course from the following two courses COMPSCI 101 Introduction to Computer Science 4 STATS 102 Introduction to Data Science 4 And complete the following courses MATH 201 Multivariable Calculus 4 MATH 202 Linear Algebra 4 MATH 206 Probability and Statistics 4 MATH 302 Numerical Analysis 4 Disciplinary Courses Course Code Course Name Course Credit COMPSCI 201 Introduction to Programming and Data Structures 4 COMPSCI 203 Discrete Math for Computer Science 4 COMPSCI 205 Computer Organization and Programming 4 COMPSCI 308 Design and Analysis of Algorithms 4 And choose one from the following three courses COMPSCI 306 Introduction to Operating Systems 4 COMPSCI 310 Introduction to Databases 4 COMPSCI 311 Computer Network Architecture 4 Electives Course Code Course Name Course Credit Systems and Architecture COMPSCI 303 Search Engines 4 COMPSCI 401 Cloud Computing 4 COMPSCI 404 Computer Architecture and Hardware Design 4 COMPSCI 405 Embedded Systems 4 Programming and Software Engineering COMPSCI 208 /MEDIART 206 Computer Graphics 4 COMPSCI 307 Software Design and Implementation 4 COMPSCI 320 Software Reliability 4 COMPSCI 403 Programming Languages and Compilers 4 COMPSCI 406 Logic and Formal Methods 4 Machine Learning and AI COMPSCI 204 Introduction to Artificial Intelligence 4 COMPSCI 309 Elements of Machine Learning 4 MATH 405 Mathematics of Data Analysis and Machine Learning 4",
      "metadata": {
        "file_name": "applied_mathematics_and_computational_sciences_with_tracks_in_computer_science_and_mathematics_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Applied Mathematics and Computational Sciences/Computer Science"
      }
    }
  ],
  "Applied Mathematics and Computational Sciences/Mathematics": [
    {
      "text": "Divisional Foundation Courses Course Code Course Name Course Credit Choose one from the following two Math courses MATH 101 Introductory Calculus 4 MATH 105 Calculus 4 And choose two of the following courses (PHYS 121 and INTGSCI 205 are strongly recommended) BIOL 110 Integrated Science – Biology 4 CHEM 110 Integrated Science – Chemistry 4 PHYS 121 Integrated Science – Physics 4 INTGSCI 205 Scientific Methods and Communication 4 Interdisciplinary Courses Course Code Course Name Course Credit Choose one from the following three courses COMPSCI 101 Introduction to Computer Science 4 STATS 102 Introduction to Data Science 4 COMPSCI 201 Introduction to Programming and Data Structures 4 And complete the following courses MATH 201 Multivariable Calculus 4 MATH 202 Linear Algebra 4 MATH 206 Probability and Statistics 4 MATH 302 Numerical Analysis 4 Disciplinary Courses Course Code Course Name Course Credit MATH 203 Advanced Calculus 4 MATH 303 ODE and Dynamical Systems 4 MATH 307 Complex Analysis 4 MATH 308 Real Analysis 4 And choose one course from the following two courses MATH 401 Abstract Algebra 4 MATH 409 Topology 4 And choose one course from the following three courses MATH 403 Partial Differential Equations 4 MATH 405 Mathematics of Data Analysis and Machine Learning 4 MATH 406 Mathematical Modeling 4 Electives Course Code Course Name Course Credit Probability & Statistics MATH 301 Advanced Introduction to Probability 4 STATS 301 Statistics 4 Theoretical Mathematics MATH 306 Number Theory 4 MATH 408 Differential Geometry 4 MATH 412 Functional Analysis 4 MATH 450 Measure and Integration 4 Applied Mathematics MATH 317 / ECON 317 Quantitative Finance 4 MATH 404 Stochastic Modeling & Computing 4 MATH 407 / PHYS 407 General Relativity 4 MATH 411/ ECON 411 Stochastic Process for Finance 4 MATH 413/ COMPSCI 413 Scientific Computing 4 MATH 414 Optimization and Control 4 Contact Administrative Building (ADB) 1st Floor, Office of Academic Services 0512 3665-7896 ug_acadservices@dukekunshan.edu.cn Feedback Form © 2025 Duke Kunshan University 苏ICP备16021093号 Google tag (gtag.js)",
      "metadata": {
        "file_name": "applied_mathematics_and_computational_sciences_with_tracks_in_computer_science_and_mathematics_-_undergraduate_degree_program___duke_kunshan_university.html",
        "Header 4": "Applied Mathematics and Computational Sciences/Mathematics"
      }
    }
  ]
}